import 'package:flutter/material.dart';

import 'package:ni_last/bangla_pages/lifeStoryPage.dart';
import 'package:ni_last/bangla_pages/media.dart';
import 'package:ni_last/bangla_pages/publish.dart';
import 'package:ni_last/english_pages/act.dart';

import '../homePage.dart';
import 'contact.dart';
import 'gallery.dart';
import 'memories.dart';
import 'news.dart';

class Activities extends StatefulWidget {
  const Activities({super.key});

  @override
  State<Activities> createState() => _ActivitiesState();
}

class _ActivitiesState extends State<Activities> {
  late List<Widget> appBarItem;

  @override
  void initState() {
    super.initState();

    appBarItem = [
      const SizedBox(
        height: 100,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const LifeStoryPage(),
              ),
            );
          },
          child: const Text(
            "জীবনের গল্প",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Activities(),
              ),
            );
          },
          child: const Text(
            "কার্যক্রম",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Publish(),
              ),
            );
          },
          child: const Text(
            "প্রকাশনা",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Memories(),
              ),
            );
          },
          child: const Text(
            "স্মৃতিচারন",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Media(),
              ),
            );
          },
          child: const Text(
            "মিডিয়া",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Gallery(),
              ),
            );
          },
          child: const Text(
            "গ্যালারি",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const News(),
              ),
            );
          },
          child: const Text(
            "সমাচার",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Contact(),
              ),
            );
          },
          child: const Text(
            "যোগাযোগ",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
    ];
  }

  bool mobile = false;

  @override
  Widget build(BuildContext context) {
    mobile = MediaQuery.of(context).size.width > 1000 ? false : true;
    return Scaffold(
      appBar: AppBar(
        toolbarHeight: 100,
        // leading: mobile ? null : Row(children: appBarItem),
        actions: [
          TextButton(
              onPressed: () {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                    builder: (context) => const Act(),
                  ),
                );
              },
              child: Text("English   "))
        ],
        title: Column(
          children: [
            SizedBox(
              height: 10,
            ),
            TextButton(
              onPressed: () {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                    builder: (context) => const Homepage(),
                  ),
                );
              },
              child: const Text(
                "নীলিমা ইব্রাহিম",
                style: TextStyle(
                    color: Colors.blueAccent,
                    fontSize: 20,
                    fontWeight: FontWeight.bold),
              ),
            ),
            SizedBox(
              height: 50,
              child: Row(
                mainAxisAlignment: MainAxisAlignment.center,
                children: mobile ? [] : appBarItem,
              ),
            ),
          ],
        ),
        centerTitle: true,
      ),
      drawer: mobile
          ? Drawer(
              child: ListView(
                children: appBarItem,
              ),
            )
          : null,
      body: LayoutBuilder(
        builder: (context, constraints) {
          if (constraints.maxWidth < 600) {
            return SingleChildScrollView(
              child: Column(
                children: [
                  const Row(
                    mainAxisAlignment: MainAxisAlignment.end,
                    children: [
                      Text(
                        "কার্যক্রম      ",
                        style: TextStyle(
                          color: Colors.blueAccent,
                          fontSize: 16,
                        ),
                      ),
                    ],
                  ),
                  const SizedBox(
                    height: 100,
                  ),
                  const Padding(
                    padding: EdgeInsets.all(50.0),
                    child: Column(
                      children: [
                        SizedBox(
                          height: 10,
                        ),
                        Text(
                          "কর্মজীবন",
                          style: TextStyle(
                            color: Colors.blueAccent,
                            fontSize: 16,
                          ),
                        ),
                        SizedBox(
                          height: 100,
                        ),
                        Text(
                            "ডক্টর নীলিমা ইব্রাহিমের কর্মজীবন দুই পর্বে বিভক্ত। একদিকে তার শিক্ষকজীবন, অন্যদিকে সমাজকল্যাণ নারী-উন্নয়নমূলক কর্মকাণ্ড। তিনি এক গৌরবোজ্জ্বল ও কীর্তিময় কর্মজীবন অতিবাহিত করেছেন। নীলিমা ইব্রাহিমের কর্মজীবন আরম্ভ ১৯৪৩ সালের জানুয়ারী মাসে কলকাতার লরেটো হাউসের বাংলার লেকচারার হিসেবে। ১৯৪৪ সালে এপ্রিল পর্যন্ত তিনি লরেটো হাউসের লেকচারার ছিলেন। এরপরই তিনি যোগদান করেন কলকাতার ভিক্টোরিয়া ইনসটিটিউশনে। এ-কলেজে বাংলার হিসেবে তিনি প্রায় আটমাস দায়িত্ব পালন করেন। ডিসেম্বর মাসে বিবাহবন্ধনে আবদ্ধ হবার পর স্বামীর সঙ্গে ঢাকা চলে আসার কারণে ভিক্টোরিয়া ইনসটিটিউশনের চাকরি তাকে ছেড়ে দিতে হয়। ঢাকায় এসে প্রথমে তিনি কোনো কাজে যোগ দেন নি। এভাবে তার শিক্ষাকতাজীবনের সাময়িক বিরতি ঘটে।"
                            "\n \n ১৯৫৬ সালের জুন মাসে নীলিমা ইব্রাহিম ঢাকা বিশ্ববিদ্যালয়ের বাংলা বিভাগে লেকচারার হিসেবে যোগ দেন। ঢাকা বিশ্ববিদ্যালয়ে শিক্ষকতাজীবন তার জীবনের এক উজ্জ্বল অধ্যায়। প্রথমে তিনি মাসিক দেড় শত টাকার গবেষণাবৃত্তি লাভ করেন। কিন্তু ১৯৫৬ সালের জুন মাসের দিকে বাংলা বিভাগের তিনজন শিক্ষক (মুনীর চৌধুরী, মোফাজ্জল হায়দার চৌধুরী এবং কাজী দীন মুহম্মদ) উচ্চতর গবেষণার জন্য একই সময়ে বিদেশে যাবার কারণে নীলিমা"
                            "\n \n ইব্রাহিম লেকচারার হিসেবে বিভাগে যোগদান করেন। ঢাকা বিশ্ববিদ্যালয়ে শিক্ষকতাজীবনের স্মৃতিচারণ করতে গিয়ে নীলিমা ইব্রাহিম লিখেছেন—"
                            "\n \n ঢাকা বিশ্ববিদ্যালয়ের ঐ সময়ের পরিচ্ছন্ন আনন্দঘন পরিবেশের কথা ভোলা যায় না। দোতলায় ছিল শিক্ষকদের কমনরুম। কলা বিভাগের সকল শিক্ষক ওখানেই বসতেন। উদয়-অস্ত ক্লাস থাকত। দুপুরে যারা প্রায়ই এক সঙ্গে বসে যেতাম তারা হচ্ছে অধ্যাপক আব্দুর রাজ্জাক, অধ্যাপক নূর মহম্মদ মিঞা, ইতিহাসের মফিজুল্লাহ কবির, মোফাজ্জল ভোজা হায়দার চৌধুরী, গিয়াসউদ্দিন, পরবর্তীতে আনিসুজ্জামান ইত্যাদি। পরস্পরের বিনিময়ের ভেতর দিয়ে খাওয়া চলত। মফিজুল্লাহ কবির সায়ের রোজই বিরিয়ানী খেতেন। আমরা ওর স্ত্রীভাগাকে হিংসা করতাম। কতো গল্প, হাসি, ঠাঁটা রাজনীতি, অর্থনীতি, হযবরল আলোচনা হত।"
                            "\n \n ১৯৫৬ সালের জুন থেকে ১৯৬৪ সালের এপ্রিল পর্যন্ত নীলিমা ইব্রাহিম বাংলা বিভাগের লেকচারার ছিলেন। বিভাগে রিডারের একটি পদ শূন্য হলে ১৯৬৪ সালের মে মাসে তিনি অস্থায়ী রিডার পদে পদোন্নতি পান। ১৯৬৫ সালের ২০শে জুলাই পর্যন্ত তিনি এই পদে অধিষ্ঠিত ছিলেন। অতঃপর তিনি বিভাগের সিনিয়র লেকচারার পদে যোগ দেন। ১৯৭০ সালের ২৫শে জুলাই পর্যন্ত সিনিয়র লেকচারার হিসেবে দায়িত্বপালন শেষে ঐ বছরের ২৬শে জুলাই থেকে তিনি বিভাগের রিডার পদে পদোন্নতি লাভ করেন। বাংলাদেশের স্বাধীনতার পর রিডার পদটি অ্যাসোসিয়েট প্রফেসর পদে রূপান্তরিত হয়। ১৯৭২ সালের ৩রা ডিসেম্বর পর্যন্ত তিনি অ্যাসোসিয়েট প্রফেসর পদে অধিষ্ঠিত ছিলেন। ঐ বছরের ৪ঠা ডিসেম্বর তিনি বাংলা বিভাগে প্রফেসর পদে যোগদান করেন। জন্ম তারিখ সম্পর্কে মাতার এফিডেভিট উপক্ষো করে ম্যাট্রিক পাসের সময় বয়স ১৬ বছর ধরে ঢাকা বিশ্ববিদ্যালয়ের সিন্ডিকেট ১৯৭৯ সালের ৩০শে জুন তাঁর অবসর ঘোষণা করে। অতঃপর ১৯৭৯ সালের ১লা জুলাই থেকে ১৯৮২ সালের ৩০শে জুন পর্যন্ত তিনি বাংলা বিভাগের সংখ্যাতিরিক্ত প্রফেসর হিসেবে দায়িত্ব পালন করে শিক্ষকতা জীবনের সমাপ্তি টানেন।"
                            "\n \n ঢাকা বিশ্ববিদ্যালয়ে শিক্ষকতাজীবনে নীলিমা ইব্রাহিম অনেক গুরুত্বপূর্ণ প্রশাসনিক দায়িত্ব পালন"
                            "\n \n করেন। ১৯৭১ সালের ১৬ই ডিসেম্বর থেকে ১৯৭৫ সালের ১৪ই অক্টোবর পর্যন্ত তিনি বাংলা বিভাগের অধ্যক্ষ/সভাপতির দায়িত্ব পালন করেন। বাংলা বিভাগের সভাপতির দায়িত্বের পাশাপাশি ১৯৭১ সালের ১৬ই ডিসেম্বর থেকে ১৯৭৩ সালের ৩০শে জুন পর্যন্ত তিনি সংস্কৃত ও পালি বিভাগের সভাপতির দায়িত্বও পালন করেন। ১৯৭১ সালের ১৬ই ডিসেম্বর থেকে ১৯৭৭ সালের ১২ই আগস্ট পর্যন্ত নীলিমা ইব্রাহিম ঢাকা বিশ্ববিদ্যালয়ের রোকেয়া হলের প্রভোস্ট ছিলেন। এ ছাড়াও শিক্ষকতাজীবনে বিশ্ববিদ্যালয় কর্তৃক প্রদত্ত নানা প্রশাসনিক দায়িত্ব তিনি নিষ্ঠার সঙ্গে পালন করেছেন।"
                            "\n \n ১৯৭৪ সালের ১২ই আগস্ট থেকে ১৯৭৫ সালের ৬ই জুন পর্যন্ত নীলিমা ইব্রাহিম বাংলা একাডেমীর মহাপরিচালক হিসেবে দায়িত্ব পালন করেন। বাংলা একাডেমীর মহাপরিচালকের দায়িত্ব পালনও তাঁর কর্মময় জীবনের এক উজ্জ্বল অধ্যায়। এখানে উল্লেখ করা প্রয়োজন যে, বাংলা একাডেমীতে তিনি অবৈতনিক মহাপরিচালক হিসেবে কর্মনির্বাহ করেন।"
                            "\n \n নীলিমা ইব্রাহিমের সমাজকল্যাণ, নারী-উন্নয়ন ও গণতান্ত্রিক সমাজ প্রতিষ্ঠার সংগ্রামকেন্দ্রিক কর্মকাণ্ড উজ্জ্বল কীর্তিতে ভাষর। জাতীয় ও আন্তর্জাতিক পর্যায়ে বিভিন্ন প্রতিষ্ঠানের কর্মকাণ্ডের সঙ্গে তিনি প্রত্যক্ষভাবে জড়িত ছিলেন। জাতীয় যে-সব প্রতিষ্ঠানের সঙ্গে তাঁর ঘনিষ্ঠ সম্পর্ক ছিল, তার মধ্যে উল্লেখযোগ্য। জীবন- সদস্য: হচ্ছে—ফেলো: বাংলা একাডেমী: বাংলাদেশ এশিয়াটিক সোসাইটি; জীবন-সদস্য, বাংলাদেশ ইতিহাস সমিতি, সভানেত্রী: বাংলাদেশ মহিলা সমিতি, জীবন-সদস্য, বাংলাদেশ রেডক্রস সমিতি; জীবন সদস্য: বাংলাদেশ পরিবার পরিকল্পনা সমিতি, চেয়ারপারসন বোর্ড অব গভর্নরস, কনসার্নড উইমেন ফর ফ্যামিলি প্লানিং ইত্যাদি। সাংগঠনিক দক্ষতা, প্রশাসনিক নৈপুণ্য এবং সূক্ষ্মা দূরদৃষ্টির জন্যে প্রতিটি প্রতিষ্ঠানেই নীলিমা ইব্রাহিম উপনীত হন নেতৃত্বের আসনে। নীলিমা ইব্রাহিম অনেক আন্তর্জাতিক প্রতিষ্ঠানের সঙ্গেও ঘনিষ্ঠভাবে যুক্ত ছিলেন। তিনি ইন্টারন্যাশনাল অ্যালায়েন্স অব উইমেন-এর সভানেত্রী হিসেবে দায়িত্ব পালন করেছেন, দায়িত্ব পালন করেছেন এসোসিয়েটেড কান্ট্রি উইম্যান অব দি ওয়ার্ড-এর সাউথ ও সেন্ট্রাল এশিয়ার এরিয়া প্রেসিডেন্ট হিসেবে। এই গুরুত্বপূর্ণ দায়িত্ব পালন করতে গিয়ে পৃথিবীর বিভিন্ন নারী-নেতৃত্বের সঙ্গে তাঁর ঘনিষ্ঠ যোগাযোগ স্থাপিত হয়, অনেকেই হয় তাঁর বন্ধু।"
                            "\n \n নীলিমা ইব্রাহিম নারী-নেত্রী, শিক্ষাবিদ, সাহিত্যিক কিংবা শাস্তি-প্রতিনিধি হিসেবে বিভিন্ন আন্তর্জাতিক সেমিনার, কর্মশালা, সম্মেলন ও সিম্পোজিয়ামে যোগদান করেন। ১৯৬৮ সালে তিনি তৎকালীন পাকিস্তানের দলীয় নেত্রীরূপে ফ্রাংকফুর্ট ও মিউনিখে অনুষ্ঠিত রাইটার্স ওয়ালর্ড কংগ্রেসে যোগদান করেন। একই বছরে দিল্লিতে অনুষ্ঠিত ‘ওয়ান এশিয়া এসেম্বলী’ শীর্ষক সেমিনারে ঢাকা বিশ্ববিদ্যালয়ের প্রতিনিধি হিসেবে তিনি যোগদান করেন। ১৯৭৪ সালে মস্কোতে অনুষ্ঠিত বিশ্বশান্তি কংগ্রেসে বাংলাদেশের প্রতিনিধিরূপে তিনি যোগ দেন। একই বছর নীলিমা ইব্রাহিম বুলগেরিয়ায় অনুষ্ঠিত আন্তর্জাতিক নারী কংগ্রেসের প্রস্তুতি কমিটিতে যোগ। দেন। ১৯৭৪ সালে শান্তি মিশনের দলনেত্রী হিসেবে নীলিমা ইব্রাহিম জাপান ভ্রমণ করেন। ১৯৭৯ সালে। লাইবেরিয়ার রাজধানী মনরোভিয়াতে ‘শিক্ষা ও নারী- প্রগতি’ শীর্ষক সেমিনারে তিনি বাংলাদেশের প্রতিনিধি রূপে যোগ দেন। ১৯৮৬ সালে তিনি নারী-সংগঠক হিসেবে মরিশাস ভ্রমণ করেন।"
                            "\n \n মেক্সিকোতে অনুষ্ঠিত প্রথম নারী কংগ্রেসে সরকারি দলের নেত্রীরূপে তিনি সহ-সভানেত্রীর দায়িত্ব পালন করেন। আন্তর্জাতিক প্রতিষ্ঠান আই এফ. ডব্লিউ-র প্রতিনিধিরূপে কোপেনহেগেনে অনুষ্ঠিত আন্তর্জাতিক সম্মেলনে যোগদান করেন। ১৯৮২ সালে নাইরোবিতে অনুষ্ঠিত ইউনিসেফ, আই.এফ. ডব্লিউ এবং এ. সি. ডব্লিউ ডব্লিউ-র প্রতিনিধি রূপে যোগদান করেন। বিভিন্ন সময়ে তিনি শিক্ষা, সংস্কৃতি, শান্তি-প্রতিনিধি কিংবা নারী-উন্নয়ন কর্মী হিসেবে ফিনল্যান্ড, সুইডেন, নরওয়ে, ফ্রান্স, জার্মানি, আয়ারল্যান্ড, স্কটল্যান্ড, যুক্তরাষ্ট্র, যুক্তরাজ্য, কানাডা, কেনিয়া, মিশর প্রভৃতি দেশ ভ্রমণ করেন। ১৯৭ সালে তিনি ইংল্যান্ডের রিডিং বিশ্ববিদ্যালয়ে ‘বাংলাদেশের কৃষিজীবী মহিলা’ শিরোনামে একটি সেমিনারে প্রবন্ধ পাঠ করেন। ১৯৮৮ সালের আগস্ট-সেপ্টেম্বর মাসে ইউরোপিয়ান কাউন্সিলের আমন্ত্রণে ইউরোপের বেশ কয়েকটি দেশে নন- ফরম্যাল এডুকেশন এন্ড দি উইম্যান ইন বাংলাদেশ! শিরোনামে প্রবন্ধ পাঠ করেন।"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 100,
                  ),
                  const Padding(
                    padding: EdgeInsets.all(50.0),
                    child: Column(
                      children: [
                        SizedBox(
                          height: 10,
                        ),
                        Text(
                          "মুক্তিযুদ্ধ- পর্ব",
                          style: TextStyle(
                            color: Colors.blueAccent,
                            fontSize: 16,
                          ),
                        ),
                        SizedBox(
                          height: 100,
                        ),
                        Text(
                            "১৯৭১ সালে মুক্তিযুদ্ধের সময় ড. নীলিমা ইব্রাহিম পালন করেন গুরুত্বপূর্ণ ভূমিকা। ভয়ঙ্কর বিপদের মুখেও তিনি দেশ ছাড়েন নি, ঢাকা শহর বা শহরের আশে পাশে থেকে তিনি মুক্তিযুদ্ধের পক্ষে কাজ করতে থাকেন। মুক্তিযোদ্ধাদের সংগঠিত করা, তাদের ইব্রাহিম। আশ্রয়ের ব্যবস্থা করা ইত্যাদি কাজে বেগম সুফিয়া কামাল ও নীলিমা ইব্রাহিম সম্মিলিতভাবে সেদিন যা করেছেন, তা অনেকেরই অজ্ঞাত। এ-কাজে তাদের প্রধান সহযোগী ছিলেন ঢাকা বিশ্ববিদ্যালয়ে ইতিহাসের শিক্ষক প্রফেসর গিয়াসউদ্দিন, যিনি মুক্তিযুদ্ধের বিজয়লগ্নে আলবদর বাহিনীর হাতে নিহত হন। মুক্তিযুদ্ধের পক্ষে নীলিমা ইব্রাহিমের সক্রিয় ভূমিকা পাকিস্তান বাহিনীর কাছে গোপন থাকে নি। মুক্তিযুদ্ধের পক্ষে কাজ করার অভিযোগ এনে জেনারেল টিক্কা খান এক পত্রের মাধ্যমে ড. নীলিমা ইব্রাহিমকে সতর্ক করে দেন। জেনারেল টিক্কা খানের। চিঠিটা ছিল নিম্নরূপ"
                            "\n \n Martial Law Headquarters Zone ‘B’, Dhaka."
                            "\n \n I. Lt. General Tikka Khan, HQA, S. PK., as Chancellor of the Dacca University, hereby warn you. Dr. Nilima Ibrahim of Bengali Department. Dacca University, that you will not indulge in the antistate activities in future"),
                        Row(
                          mainAxisAlignment: MainAxisAlignment.end,
                          children: [
                            Text("Sd/- Tikka Khan, Lt. General"
                                " \n   Martial Law Administrator"),
                          ],
                        ),
                        Row(
                          mainAxisAlignment: MainAxisAlignment.end,
                          children: [
                            Text("Zone ‘B"),
                          ],
                        ),
                        Row(
                          mainAxisAlignment: MainAxisAlignment.start,
                          children: [
                            Flexible(
                              child: Text("Place: Dacca"
                                  "\nDated: 1 September, 1971 Governor of East Pakistan"),
                            ),
                          ],
                        ),
                        SizedBox(
                          height: 50,
                        ),
                        Column(
                          children: [
                            Text(
                                "মুক্তিযুদ্ধের সময়ের মতো যুদ্ধোত্তর পর্বেও নীলিমা ইব্রাহিমকে পালন করতে হয় কতিপয় গুরুত্বপূর্ণ দায়িত্ব। ঢাকা বিশ্ববিদ্যালয় বাংলা বিভাগের শিক্ষকসহ অনেক বুদ্ধিজীবীকে রাজাকার ও আলবদর বাহিনী ধরে নিয়ে যায়। এসব বুদ্ধিজীবীকে উদ্ধার বা তাদের অনুসন্ধান কাজে নীলিমা ইব্রাহিম পালন করেন সাহসী ভূমিকা। বিভাগের তরুণ সহকর্মী রফিকুল ইসলামকে নিয়ে নীলিমা ইব্রাহিম মিরপুর গোরস্থান সংলগ্ন গণকবরটি আবিষ্কার করেন। ঐ গণকবরে ঢাকা বিশ্ববিদ্যালয়ের অনেক শিক্ষক, কর্মকর্তাকে গুলি করে পুতে রাখা হয়। করে স্থানে শহীদ বুদ্ধিজীবী স্মৃতিসৌধ নির্মাণেও নীলিমা ইব্রাহিম অগ্রণী ভূমিকা পারন করেন। শেখ মুজিবুর রহমানের কাছে গিয়ে শহীদ বুদ্ধিজীবী স্মৃতিসৌধ নির্মাণের ব্যবস্থা করেন ড. নীলিমা ইব্রাহিম মুক্তিযুদ্ধের পর বঙ্গবন্ধু শেখ মুজিবর রহমান ড: নীলিমা ইব্রাহিমের দুটি স্পর্শকাতর বিষয়ে দায়িত্ব নাস্ত করেন। প্রথম দায়িত্ব ছিলো মুক্তিযুদ্ধের সম পাকিস্তানি সৈন্য ও তাদের দালাল রাজাকার আলশামস-আলবদর-শান্তি কমিটির নরপশুদের দ্বারা অপহৃত লাঞ্ছিত নির্যাতিত ধর্ষিত অসংখ্য বাঙালি নারী এবং ওয়ারবেবিদের পুনবার্সনের ব্যবস্থা করা। এ সময় হতভাগা নারীদের পুর্নবাসন ও ওয়ারবেবিদের বিদেশীগণ কর্তৃক এডাপ্ট করার সমস্যা নিয়ে নীলিমা ইব্রাহিম কঠোর পরিশ্রম করেছেন। এ-কাজে তাকে বিশেষভাবে সহযোগিতা করেন বিচারপতি কে এম সোবহান। নীলিমা ইব্রাহিমের সুপারিশের ফলেই নির্যাতিত অনেক নারীর সম্মানজনক পুনর্বাসন অনেক ওয়ারবেবির এডাপ্টের কাজ সাফল্যের সঙ্গে সম্পন্ন হয়। ড. নীলিমা ইব্রাহিমের কাছে বঙ্গবন্ধু আরো একটি স্পর্শকাতর দায়িত্ব অর্পন করেন। ১৯৭১ সালে মুক্তিযুদ্ধের সময় যে সব বুদ্ধিজীবী এবং শিল্পী বেতার ও টেলিভিশনে পাকিস্তানের দালালি এবং মুক্তিযুদ্ধের বিরোধিতা করেছে, সেসব সাংস্কৃতিক-রাজাকারদের বিষয়ে সিদ্ধান্ত গ্রহণ। কাজে তাকে সহযোগিতা ঢাকা বিশ্ববিদ্যালয় ইংরেজি বিভাগের শিক্ষক অধ্যাপক আহসানুল হক এবং সাংবাদিক জনাব এ বি এম মূসা। কমিটির সুপারিশ অনুযায়ী বাংলাদেশের প্রচার মাধ্যমে দালাল- শিল্পীদের অনুষ্ঠান প্রচার বন্ধ করে দেওয়া হয়। পরে অবশ্য বঙ্গবন্ধু দালাল-শিল্পীদের ক্ষমা করে দেন। তবে, ১৯৭১ সালে বেতার ও টেলিভিশনে পাকিস্তানের দালাল বুদ্ধিজীবী ও শিল্পীদের কার্যক্রম সম্পর্কে নীলিমা ইব্রাহিম কমিটির রিপোর্ট একটি ঐতিহাসিক দলিল।"),
                          ],
                        ),
                      ],
                    ),
                  ),
                  const Padding(
                    padding: EdgeInsets.all(50.0),
                    child: Column(
                      children: [
                        SizedBox(
                          height: 10,
                        ),
                        Text(
                          "সাহিত্য জীবন",
                          style: TextStyle(
                            color: Colors.blueAccent,
                            fontSize: 16,
                          ),
                        ),
                        SizedBox(
                          height: 100,
                        ),
                        Text(
                            "নীলিমা ইব্রাহিম স্কুলজীবন থেকেই সাহিত্যকর্মের সঙ্গে নানা সুত্রে জড়িত হন। অনুকূল পারিবারিক পরিমণ্ডল সাহিত্যের প্রতি অনুরাগী হয়ে উঠতে তাঁকে সহায়তা করে। স্কুলের বার্ষিকীতে গল্প, প্রবন্ধ লিখে তার সাহিত্য-জীবনের সূত্রপাত ঘটে। উত্তর- জীবনে সাহিত্যের বিভিন্ন শাখায় তিনি বিচরণ করেছেন, লিখেছেন গুরুত্বপূর্ণ অনেক গ্রন্থ। নিচে নীলিমা ইব্রাহিমের প্রকাশনা তথ্য উপস্থাপিত হল—"),
                      ],
                    ),
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ক. প্রবন্ধ-গবেষণা",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.all(50.0),
                    child: Column(
                      children: [
                        Text(
                            "শরৎ-প্রতিভা (১৯৩০), বাংলা সাহিত্যের ইতিবৃত্ত (১৯৬০), বাংলার কবি মধুসুদন (১৯৬১), ঊনবিংশ শতাব্দীর বাঙালী সমাজ ও বাংলা নাটক (১৯৬৪), বাংলা নাটক : উৎস ও ধারা (১৯৭২), বেগম রোকেয়া (১৯৭৪), বাঙ্গালীমানস ও বাংলা সাহিত্য (১৯৮৭), সাহিত্য-সংস্কৃতির নানা প্রসঙ্গ (১৯৯১), সূর্যোদয় থেকে সূর্যাস্ত : অতঃপর অমানিশার অন্ধকার (১৯৯৫), অগ্নিস্নাত বঙ্গবন্ধুর ভয়াচ্ছাদিত কন্যা আমি (১৯৯৫), (১৯৯৬)। বেগম ফজিলাতুন্নেসা মুজিব"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "খ. ছোটগল্প",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Text("রমনা পার্কে (১৯৬৪)"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "গ. উপন্যাস",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                          child: Text(
                              "বিশ শতকের মেয়ে (১৯৫৮), পথ শ্রান্ত (১৯৫৮), এক পথ দুই বাক (১৯৫৮), কেয়াবন সঞ্চারিণী (১৯৬২), বহ্নিবলয় (১৯৮৫)।"),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ঘ.কথানাট্য",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                            child: Text(
                                "আমি বীরাঙ্গনা বলছি (প. খণ্ড ১৯৯৬, দ্বি. খণ্ড ১৯৯৭) ।")),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ঙ. নাটক",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                          child: Text(
                              "দুয়ে দুয়ে চার (১৯৬৪), যে অরণ্যে আলো নেই (১৯৭৪), রোদ-জ্বলা বিকেল (১৯৭৪), সূর্যাস্তের পর (১৯৭৪)।"),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "চ. অনুবাদ",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                          child: Text(
                              "এলিনর রুজভেল্ট (১৯৫৫), কথাশিল্পী জেমস ফেনিমোর কুপার (১৯৬৮), বস্টনের পথে (১৯৬৯)।"),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ছ. ভ্রমণকাহিনী",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Text("শাহী এলাকার পথে পথে (১৯৬৩)।"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "জ. আত্মকাহিনী",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Text("বিন্দু-বিসর্গ (১৯৯১)।"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ঝ. রচনাবলী",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                          child: Text(
                              "বনীলিমা ইব্রাহিম রচনাসমগ্র (১ম খন্ড, ২০০১)"
                              "\nউপর্যুক্ত গ্রন্থ ছাড়াও তার আরো অনেক লেখা অগ্রন্থিত অবস্থায় রয়েছে। বিভিন্ন সাময়িকী এবং গবেষণা-পত্রিকায় মুদ্রিত নীলিমা ইব্রাহিমের প্রবন্ধ থেকে একাধিক গ্রন্থ বর্তমানে প্রকাশের প্রক্রিয়াধীন রয়েছে।"),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  Container(
                    height: 60,
                    color: Colors.black,
                    child: const Center(
                      child: Text(
                        "Copyright 2024, All Rights Reserved",
                        style: TextStyle(
                            color: Colors.white, fontWeight: FontWeight.bold),
                      ),
                    ),
                  ),
                ],
              ),
            );
          } else {
            return SingleChildScrollView(
              child: Column(
                children: [
                  const Row(
                    mainAxisAlignment: MainAxisAlignment.end,
                    children: [
                      Text(
                        "কার্যক্রম      ",
                        style: TextStyle(
                          color: Colors.blueAccent,
                          fontSize: 16,
                        ),
                      ),
                    ],
                  ),
                  const SizedBox(
                    height: 100,
                  ),
                  const Padding(
                    padding: EdgeInsets.all(50.0),
                    child: Column(
                      children: [
                        SizedBox(
                          height: 10,
                        ),
                        Text(
                          "কর্মজীবন",
                          style: TextStyle(
                            color: Colors.blueAccent,
                            fontSize: 16,
                          ),
                        ),
                        SizedBox(
                          height: 100,
                        ),
                        Text(
                            "ডক্টর নীলিমা ইব্রাহিমের কর্মজীবন দুই পর্বে বিভক্ত। একদিকে তার শিক্ষকজীবন, অন্যদিকে সমাজকল্যাণ নারী-উন্নয়নমূলক কর্মকাণ্ড। তিনি এক গৌরবোজ্জ্বল ও কীর্তিময় কর্মজীবন অতিবাহিত করেছেন। নীলিমা ইব্রাহিমের কর্মজীবন আরম্ভ ১৯৪৩ সালের জানুয়ারী মাসে কলকাতার লরেটো হাউসের বাংলার লেকচারার হিসেবে। ১৯৪৪ সালে এপ্রিল পর্যন্ত তিনি লরেটো হাউসের লেকচারার ছিলেন। এরপরই তিনি যোগদান করেন কলকাতার ভিক্টোরিয়া ইনসটিটিউশনে। এ-কলেজে বাংলার হিসেবে তিনি প্রায় আটমাস দায়িত্ব পালন করেন। ডিসেম্বর মাসে বিবাহবন্ধনে আবদ্ধ হবার পর স্বামীর সঙ্গে ঢাকা চলে আসার কারণে ভিক্টোরিয়া ইনসটিটিউশনের চাকরি তাকে ছেড়ে দিতে হয়। ঢাকায় এসে প্রথমে তিনি কোনো কাজে যোগ দেন নি। এভাবে তার শিক্ষাকতাজীবনের সাময়িক বিরতি ঘটে।"
                            "\n \n ১৯৫৬ সালের জুন মাসে নীলিমা ইব্রাহিম ঢাকা বিশ্ববিদ্যালয়ের বাংলা বিভাগে লেকচারার হিসেবে যোগ দেন। ঢাকা বিশ্ববিদ্যালয়ে শিক্ষকতাজীবন তার জীবনের এক উজ্জ্বল অধ্যায়। প্রথমে তিনি মাসিক দেড় শত টাকার গবেষণাবৃত্তি লাভ করেন। কিন্তু ১৯৫৬ সালের জুন মাসের দিকে বাংলা বিভাগের তিনজন শিক্ষক (মুনীর চৌধুরী, মোফাজ্জল হায়দার চৌধুরী এবং কাজী দীন মুহম্মদ) উচ্চতর গবেষণার জন্য একই সময়ে বিদেশে যাবার কারণে নীলিমা"
                            "\n \n ইব্রাহিম লেকচারার হিসেবে বিভাগে যোগদান করেন। ঢাকা বিশ্ববিদ্যালয়ে শিক্ষকতাজীবনের স্মৃতিচারণ করতে গিয়ে নীলিমা ইব্রাহিম লিখেছেন—"
                            "\n \n ঢাকা বিশ্ববিদ্যালয়ের ঐ সময়ের পরিচ্ছন্ন আনন্দঘন পরিবেশের কথা ভোলা যায় না। দোতলায় ছিল শিক্ষকদের কমনরুম। কলা বিভাগের সকল শিক্ষক ওখানেই বসতেন। উদয়-অস্ত ক্লাস থাকত। দুপুরে যারা প্রায়ই এক সঙ্গে বসে যেতাম তারা হচ্ছে অধ্যাপক আব্দুর রাজ্জাক, অধ্যাপক নূর মহম্মদ মিঞা, ইতিহাসের মফিজুল্লাহ কবির, মোফাজ্জল ভোজা হায়দার চৌধুরী, গিয়াসউদ্দিন, পরবর্তীতে আনিসুজ্জামান ইত্যাদি। পরস্পরের বিনিময়ের ভেতর দিয়ে খাওয়া চলত। মফিজুল্লাহ কবির সায়ের রোজই বিরিয়ানী খেতেন। আমরা ওর স্ত্রীভাগাকে হিংসা করতাম। কতো গল্প, হাসি, ঠাঁটা রাজনীতি, অর্থনীতি, হযবরল আলোচনা হত।"
                            "\n \n ১৯৫৬ সালের জুন থেকে ১৯৬৪ সালের এপ্রিল পর্যন্ত নীলিমা ইব্রাহিম বাংলা বিভাগের লেকচারার ছিলেন। বিভাগে রিডারের একটি পদ শূন্য হলে ১৯৬৪ সালের মে মাসে তিনি অস্থায়ী রিডার পদে পদোন্নতি পান। ১৯৬৫ সালের ২০শে জুলাই পর্যন্ত তিনি এই পদে অধিষ্ঠিত ছিলেন। অতঃপর তিনি বিভাগের সিনিয়র লেকচারার পদে যোগ দেন। ১৯৭০ সালের ২৫শে জুলাই পর্যন্ত সিনিয়র লেকচারার হিসেবে দায়িত্বপালন শেষে ঐ বছরের ২৬শে জুলাই থেকে তিনি বিভাগের রিডার পদে পদোন্নতি লাভ করেন। বাংলাদেশের স্বাধীনতার পর রিডার পদটি অ্যাসোসিয়েট প্রফেসর পদে রূপান্তরিত হয়। ১৯৭২ সালের ৩রা ডিসেম্বর পর্যন্ত তিনি অ্যাসোসিয়েট প্রফেসর পদে অধিষ্ঠিত ছিলেন। ঐ বছরের ৪ঠা ডিসেম্বর তিনি বাংলা বিভাগে প্রফেসর পদে যোগদান করেন। জন্ম তারিখ সম্পর্কে মাতার এফিডেভিট উপক্ষো করে ম্যাট্রিক পাসের সময় বয়স ১৬ বছর ধরে ঢাকা বিশ্ববিদ্যালয়ের সিন্ডিকেট ১৯৭৯ সালের ৩০শে জুন তাঁর অবসর ঘোষণা করে। অতঃপর ১৯৭৯ সালের ১লা জুলাই থেকে ১৯৮২ সালের ৩০শে জুন পর্যন্ত তিনি বাংলা বিভাগের সংখ্যাতিরিক্ত প্রফেসর হিসেবে দায়িত্ব পালন করে শিক্ষকতা জীবনের সমাপ্তি টানেন।"
                            "\n \n ঢাকা বিশ্ববিদ্যালয়ে শিক্ষকতাজীবনে নীলিমা ইব্রাহিম অনেক গুরুত্বপূর্ণ প্রশাসনিক দায়িত্ব পালন"
                            "\n \n করেন। ১৯৭১ সালের ১৬ই ডিসেম্বর থেকে ১৯৭৫ সালের ১৪ই অক্টোবর পর্যন্ত তিনি বাংলা বিভাগের অধ্যক্ষ/সভাপতির দায়িত্ব পালন করেন। বাংলা বিভাগের সভাপতির দায়িত্বের পাশাপাশি ১৯৭১ সালের ১৬ই ডিসেম্বর থেকে ১৯৭৩ সালের ৩০শে জুন পর্যন্ত তিনি সংস্কৃত ও পালি বিভাগের সভাপতির দায়িত্বও পালন করেন। ১৯৭১ সালের ১৬ই ডিসেম্বর থেকে ১৯৭৭ সালের ১২ই আগস্ট পর্যন্ত নীলিমা ইব্রাহিম ঢাকা বিশ্ববিদ্যালয়ের রোকেয়া হলের প্রভোস্ট ছিলেন। এ ছাড়াও শিক্ষকতাজীবনে বিশ্ববিদ্যালয় কর্তৃক প্রদত্ত নানা প্রশাসনিক দায়িত্ব তিনি নিষ্ঠার সঙ্গে পালন করেছেন।"
                            "\n \n ১৯৭৪ সালের ১২ই আগস্ট থেকে ১৯৭৫ সালের ৬ই জুন পর্যন্ত নীলিমা ইব্রাহিম বাংলা একাডেমীর মহাপরিচালক হিসেবে দায়িত্ব পালন করেন। বাংলা একাডেমীর মহাপরিচালকের দায়িত্ব পালনও তাঁর কর্মময় জীবনের এক উজ্জ্বল অধ্যায়। এখানে উল্লেখ করা প্রয়োজন যে, বাংলা একাডেমীতে তিনি অবৈতনিক মহাপরিচালক হিসেবে কর্মনির্বাহ করেন।"
                            "\n \n নীলিমা ইব্রাহিমের সমাজকল্যাণ, নারী-উন্নয়ন ও গণতান্ত্রিক সমাজ প্রতিষ্ঠার সংগ্রামকেন্দ্রিক কর্মকাণ্ড উজ্জ্বল কীর্তিতে ভাষর। জাতীয় ও আন্তর্জাতিক পর্যায়ে বিভিন্ন প্রতিষ্ঠানের কর্মকাণ্ডের সঙ্গে তিনি প্রত্যক্ষভাবে জড়িত ছিলেন। জাতীয় যে-সব প্রতিষ্ঠানের সঙ্গে তাঁর ঘনিষ্ঠ সম্পর্ক ছিল, তার মধ্যে উল্লেখযোগ্য। জীবন- সদস্য: হচ্ছে—ফেলো: বাংলা একাডেমী: বাংলাদেশ এশিয়াটিক সোসাইটি; জীবন-সদস্য, বাংলাদেশ ইতিহাস সমিতি, সভানেত্রী: বাংলাদেশ মহিলা সমিতি, জীবন-সদস্য, বাংলাদেশ রেডক্রস সমিতি; জীবন সদস্য: বাংলাদেশ পরিবার পরিকল্পনা সমিতি, চেয়ারপারসন বোর্ড অব গভর্নরস, কনসার্নড উইমেন ফর ফ্যামিলি প্লানিং ইত্যাদি। সাংগঠনিক দক্ষতা, প্রশাসনিক নৈপুণ্য এবং সূক্ষ্মা দূরদৃষ্টির জন্যে প্রতিটি প্রতিষ্ঠানেই নীলিমা ইব্রাহিম উপনীত হন নেতৃত্বের আসনে। নীলিমা ইব্রাহিম অনেক আন্তর্জাতিক প্রতিষ্ঠানের সঙ্গেও ঘনিষ্ঠভাবে যুক্ত ছিলেন। তিনি ইন্টারন্যাশনাল অ্যালায়েন্স অব উইমেন-এর সভানেত্রী হিসেবে দায়িত্ব পালন করেছেন, দায়িত্ব পালন করেছেন এসোসিয়েটেড কান্ট্রি উইম্যান অব দি ওয়ার্ড-এর সাউথ ও সেন্ট্রাল এশিয়ার এরিয়া প্রেসিডেন্ট হিসেবে। এই গুরুত্বপূর্ণ দায়িত্ব পালন করতে গিয়ে পৃথিবীর বিভিন্ন নারী-নেতৃত্বের সঙ্গে তাঁর ঘনিষ্ঠ যোগাযোগ স্থাপিত হয়, অনেকেই হয় তাঁর বন্ধু।"
                            "\n \n নীলিমা ইব্রাহিম নারী-নেত্রী, শিক্ষাবিদ, সাহিত্যিক কিংবা শাস্তি-প্রতিনিধি হিসেবে বিভিন্ন আন্তর্জাতিক সেমিনার, কর্মশালা, সম্মেলন ও সিম্পোজিয়ামে যোগদান করেন। ১৯৬৮ সালে তিনি তৎকালীন পাকিস্তানের দলীয় নেত্রীরূপে ফ্রাংকফুর্ট ও মিউনিখে অনুষ্ঠিত রাইটার্স ওয়ালর্ড কংগ্রেসে যোগদান করেন। একই বছরে দিল্লিতে অনুষ্ঠিত ‘ওয়ান এশিয়া এসেম্বলী’ শীর্ষক সেমিনারে ঢাকা বিশ্ববিদ্যালয়ের প্রতিনিধি হিসেবে তিনি যোগদান করেন। ১৯৭৪ সালে মস্কোতে অনুষ্ঠিত বিশ্বশান্তি কংগ্রেসে বাংলাদেশের প্রতিনিধিরূপে তিনি যোগ দেন। একই বছর নীলিমা ইব্রাহিম বুলগেরিয়ায় অনুষ্ঠিত আন্তর্জাতিক নারী কংগ্রেসের প্রস্তুতি কমিটিতে যোগ। দেন। ১৯৭৪ সালে শান্তি মিশনের দলনেত্রী হিসেবে নীলিমা ইব্রাহিম জাপান ভ্রমণ করেন। ১৯৭৯ সালে। লাইবেরিয়ার রাজধানী মনরোভিয়াতে ‘শিক্ষা ও নারী- প্রগতি’ শীর্ষক সেমিনারে তিনি বাংলাদেশের প্রতিনিধি রূপে যোগ দেন। ১৯৮৬ সালে তিনি নারী-সংগঠক হিসেবে মরিশাস ভ্রমণ করেন।"
                            "\n \n মেক্সিকোতে অনুষ্ঠিত প্রথম নারী কংগ্রেসে সরকারি দলের নেত্রীরূপে তিনি সহ-সভানেত্রীর দায়িত্ব পালন করেন। আন্তর্জাতিক প্রতিষ্ঠান আই এফ. ডব্লিউ-র প্রতিনিধিরূপে কোপেনহেগেনে অনুষ্ঠিত আন্তর্জাতিক সম্মেলনে যোগদান করেন। ১৯৮২ সালে নাইরোবিতে অনুষ্ঠিত ইউনিসেফ, আই.এফ. ডব্লিউ এবং এ. সি. ডব্লিউ ডব্লিউ-র প্রতিনিধি রূপে যোগদান করেন। বিভিন্ন সময়ে তিনি শিক্ষা, সংস্কৃতি, শান্তি-প্রতিনিধি কিংবা নারী-উন্নয়ন কর্মী হিসেবে ফিনল্যান্ড, সুইডেন, নরওয়ে, ফ্রান্স, জার্মানি, আয়ারল্যান্ড, স্কটল্যান্ড, যুক্তরাষ্ট্র, যুক্তরাজ্য, কানাডা, কেনিয়া, মিশর প্রভৃতি দেশ ভ্রমণ করেন। ১৯৭ সালে তিনি ইংল্যান্ডের রিডিং বিশ্ববিদ্যালয়ে ‘বাংলাদেশের কৃষিজীবী মহিলা’ শিরোনামে একটি সেমিনারে প্রবন্ধ পাঠ করেন। ১৯৮৮ সালের আগস্ট-সেপ্টেম্বর মাসে ইউরোপিয়ান কাউন্সিলের আমন্ত্রণে ইউরোপের বেশ কয়েকটি দেশে নন- ফরম্যাল এডুকেশন এন্ড দি উইম্যান ইন বাংলাদেশ! শিরোনামে প্রবন্ধ পাঠ করেন।"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 100,
                  ),
                  const Padding(
                    padding: EdgeInsets.all(50.0),
                    child: Column(
                      children: [
                        SizedBox(
                          height: 10,
                        ),
                        Text(
                          "মুক্তিযুদ্ধ- পর্ব",
                          style: TextStyle(
                            color: Colors.blueAccent,
                            fontSize: 16,
                          ),
                        ),
                        SizedBox(
                          height: 100,
                        ),
                        Text(
                            "১৯৭১ সালে মুক্তিযুদ্ধের সময় ড. নীলিমা ইব্রাহিম পালন করেন গুরুত্বপূর্ণ ভূমিকা। ভয়ঙ্কর বিপদের মুখেও তিনি দেশ ছাড়েন নি, ঢাকা শহর বা শহরের আশে পাশে থেকে তিনি মুক্তিযুদ্ধের পক্ষে কাজ করতে থাকেন। মুক্তিযোদ্ধাদের সংগঠিত করা, তাদের ইব্রাহিম। আশ্রয়ের ব্যবস্থা করা ইত্যাদি কাজে বেগম সুফিয়া কামাল ও নীলিমা ইব্রাহিম সম্মিলিতভাবে সেদিন যা করেছেন, তা অনেকেরই অজ্ঞাত। এ-কাজে তাদের প্রধান সহযোগী ছিলেন ঢাকা বিশ্ববিদ্যালয়ে ইতিহাসের শিক্ষক প্রফেসর গিয়াসউদ্দিন, যিনি মুক্তিযুদ্ধের বিজয়লগ্নে আলবদর বাহিনীর হাতে নিহত হন। মুক্তিযুদ্ধের পক্ষে নীলিমা ইব্রাহিমের সক্রিয় ভূমিকা পাকিস্তান বাহিনীর কাছে গোপন থাকে নি। মুক্তিযুদ্ধের পক্ষে কাজ করার অভিযোগ এনে জেনারেল টিক্কা খান এক পত্রের মাধ্যমে ড. নীলিমা ইব্রাহিমকে সতর্ক করে দেন। জেনারেল টিক্কা খানের। চিঠিটা ছিল নিম্নরূপ"
                            "\n \n Martial Law Headquarters Zone ‘B’, Dhaka."
                            "\n \n I. Lt. General Tikka Khan, HQA, S. PK., as Chancellor of the Dacca University, hereby warn you. Dr. Nilima Ibrahim of Bengali Department. Dacca University, that you will not indulge in the antistate activities in future"),
                        Row(
                          mainAxisAlignment: MainAxisAlignment.end,
                          children: [
                            Text("Sd/- Tikka Khan, Lt. General"
                                " \n   Martial Law Administrator"),
                          ],
                        ),
                        Row(
                          mainAxisAlignment: MainAxisAlignment.end,
                          children: [
                            Text("Zone ‘B"),
                          ],
                        ),
                        Row(
                          mainAxisAlignment: MainAxisAlignment.start,
                          children: [
                            Flexible(
                              child: Text("Place: Dacca"
                                  "\nDated: 1 September, 1971 Governor of East Pakistan"),
                            ),
                          ],
                        ),
                        SizedBox(
                          height: 50,
                        ),
                        Column(
                          children: [
                            Text(
                                "মুক্তিযুদ্ধের সময়ের মতো যুদ্ধোত্তর পর্বেও নীলিমা ইব্রাহিমকে পালন করতে হয় কতিপয় গুরুত্বপূর্ণ দায়িত্ব। ঢাকা বিশ্ববিদ্যালয় বাংলা বিভাগের শিক্ষকসহ অনেক বুদ্ধিজীবীকে রাজাকার ও আলবদর বাহিনী ধরে নিয়ে যায়। এসব বুদ্ধিজীবীকে উদ্ধার বা তাদের অনুসন্ধান কাজে নীলিমা ইব্রাহিম পালন করেন সাহসী ভূমিকা। বিভাগের তরুণ সহকর্মী রফিকুল ইসলামকে নিয়ে নীলিমা ইব্রাহিম মিরপুর গোরস্থান সংলগ্ন গণকবরটি আবিষ্কার করেন। ঐ গণকবরে ঢাকা বিশ্ববিদ্যালয়ের অনেক শিক্ষক, কর্মকর্তাকে গুলি করে পুতে রাখা হয়। করে স্থানে শহীদ বুদ্ধিজীবী স্মৃতিসৌধ নির্মাণেও নীলিমা ইব্রাহিম অগ্রণী ভূমিকা পারন করেন। শেখ মুজিবুর রহমানের কাছে গিয়ে শহীদ বুদ্ধিজীবী স্মৃতিসৌধ নির্মাণের ব্যবস্থা করেন ড. নীলিমা ইব্রাহিম মুক্তিযুদ্ধের পর বঙ্গবন্ধু শেখ মুজিবর রহমান ড: নীলিমা ইব্রাহিমের দুটি স্পর্শকাতর বিষয়ে দায়িত্ব নাস্ত করেন। প্রথম দায়িত্ব ছিলো মুক্তিযুদ্ধের সম পাকিস্তানি সৈন্য ও তাদের দালাল রাজাকার আলশামস-আলবদর-শান্তি কমিটির নরপশুদের দ্বারা অপহৃত লাঞ্ছিত নির্যাতিত ধর্ষিত অসংখ্য বাঙালি নারী এবং ওয়ারবেবিদের পুনবার্সনের ব্যবস্থা করা। এ সময় হতভাগা নারীদের পুর্নবাসন ও ওয়ারবেবিদের বিদেশীগণ কর্তৃক এডাপ্ট করার সমস্যা নিয়ে নীলিমা ইব্রাহিম কঠোর পরিশ্রম করেছেন। এ-কাজে তাকে বিশেষভাবে সহযোগিতা করেন বিচারপতি কে এম সোবহান। নীলিমা ইব্রাহিমের সুপারিশের ফলেই নির্যাতিত অনেক নারীর সম্মানজনক পুনর্বাসন অনেক ওয়ারবেবির এডাপ্টের কাজ সাফল্যের সঙ্গে সম্পন্ন হয়। ড. নীলিমা ইব্রাহিমের কাছে বঙ্গবন্ধু আরো একটি স্পর্শকাতর দায়িত্ব অর্পন করেন। ১৯৭১ সালে মুক্তিযুদ্ধের সময় যে সব বুদ্ধিজীবী এবং শিল্পী বেতার ও টেলিভিশনে পাকিস্তানের দালালি এবং মুক্তিযুদ্ধের বিরোধিতা করেছে, সেসব সাংস্কৃতিক-রাজাকারদের বিষয়ে সিদ্ধান্ত গ্রহণ। কাজে তাকে সহযোগিতা ঢাকা বিশ্ববিদ্যালয় ইংরেজি বিভাগের শিক্ষক অধ্যাপক আহসানুল হক এবং সাংবাদিক জনাব এ বি এম মূসা। কমিটির সুপারিশ অনুযায়ী বাংলাদেশের প্রচার মাধ্যমে দালাল- শিল্পীদের অনুষ্ঠান প্রচার বন্ধ করে দেওয়া হয়। পরে অবশ্য বঙ্গবন্ধু দালাল-শিল্পীদের ক্ষমা করে দেন। তবে, ১৯৭১ সালে বেতার ও টেলিভিশনে পাকিস্তানের দালাল বুদ্ধিজীবী ও শিল্পীদের কার্যক্রম সম্পর্কে নীলিমা ইব্রাহিম কমিটির রিপোর্ট একটি ঐতিহাসিক দলিল।"),
                          ],
                        ),
                      ],
                    ),
                  ),
                  const Padding(
                    padding: EdgeInsets.all(50.0),
                    child: Column(
                      children: [
                        SizedBox(
                          height: 10,
                        ),
                        Text(
                          "সাহিত্য জীবন",
                          style: TextStyle(
                            color: Colors.blueAccent,
                            fontSize: 16,
                          ),
                        ),
                        SizedBox(
                          height: 100,
                        ),
                        Text(
                            "নীলিমা ইব্রাহিম স্কুলজীবন থেকেই সাহিত্যকর্মের সঙ্গে নানা সুত্রে জড়িত হন। অনুকূল পারিবারিক পরিমণ্ডল সাহিত্যের প্রতি অনুরাগী হয়ে উঠতে তাঁকে সহায়তা করে। স্কুলের বার্ষিকীতে গল্প, প্রবন্ধ লিখে তার সাহিত্য-জীবনের সূত্রপাত ঘটে। উত্তর- জীবনে সাহিত্যের বিভিন্ন শাখায় তিনি বিচরণ করেছেন, লিখেছেন গুরুত্বপূর্ণ অনেক গ্রন্থ। নিচে নীলিমা ইব্রাহিমের প্রকাশনা তথ্য উপস্থাপিত হল—"),
                      ],
                    ),
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ক. প্রবন্ধ-গবেষণা",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.all(50.0),
                    child: Column(
                      children: [
                        Text(
                            "শরৎ-প্রতিভা (১৯৩০), বাংলা সাহিত্যের ইতিবৃত্ত (১৯৬০), বাংলার কবি মধুসুদন (১৯৬১), ঊনবিংশ শতাব্দীর বাঙালী সমাজ ও বাংলা নাটক (১৯৬৪), বাংলা নাটক : উৎস ও ধারা (১৯৭২), বেগম রোকেয়া (১৯৭৪), বাঙ্গালীমানস ও বাংলা সাহিত্য (১৯৮৭), সাহিত্য-সংস্কৃতির নানা প্রসঙ্গ (১৯৯১), সূর্যোদয় থেকে সূর্যাস্ত : অতঃপর অমানিশার অন্ধকার (১৯৯৫), অগ্নিস্নাত বঙ্গবন্ধুর ভয়াচ্ছাদিত কন্যা আমি (১৯৯৫), (১৯৯৬)। বেগম ফজিলাতুন্নেসা মুজিব"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "খ. ছোটগল্প",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Text("রমনা পার্কে (১৯৬৪)"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "গ. উপন্যাস",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                          child: Text(
                              "বিশ শতকের মেয়ে (১৯৫৮), পথ শ্রান্ত (১৯৫৮), এক পথ দুই বাক (১৯৫৮), কেয়াবন সঞ্চারিণী (১৯৬২), বহ্নিবলয় (১৯৮৫)।"),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ঘ.কথানাট্য",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                            child: Text(
                                "আমি বীরাঙ্গনা বলছি (প. খণ্ড ১৯৯৬, দ্বি. খণ্ড ১৯৯৭) ।")),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ঙ. নাটক",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                          child: Text(
                              "দুয়ে দুয়ে চার (১৯৬৪), যে অরণ্যে আলো নেই (১৯৭৪), রোদ-জ্বলা বিকেল (১৯৭৪), সূর্যাস্তের পর (১৯৭৪)।"),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "চ. অনুবাদ",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                          child: Text(
                              "এলিনর রুজভেল্ট (১৯৫৫), কথাশিল্পী জেমস ফেনিমোর কুপার (১৯৬৮), বস্টনের পথে (১৯৬৯)।"),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ছ. ভ্রমণকাহিনী",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Text("শাহী এলাকার পথে পথে (১৯৬৩)।"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "জ. আত্মকাহিনী",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Text("বিন্দু-বিসর্গ (১৯৯১)।"),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50),
                    child: Row(
                      children: [
                        Text(
                          "ঝ. রচনাবলী",
                          style: TextStyle(
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 10,
                  ),
                  const Padding(
                    padding: EdgeInsets.symmetric(horizontal: 50.0),
                    child: Row(
                      children: [
                        Flexible(
                          child: Text(
                              "বনীলিমা ইব্রাহিম রচনাসমগ্র (১ম খন্ড, ২০০১)"
                              "\nউপর্যুক্ত গ্রন্থ ছাড়াও তার আরো অনেক লেখা অগ্রন্থিত অবস্থায় রয়েছে। বিভিন্ন সাময়িকী এবং গবেষণা-পত্রিকায় মুদ্রিত নীলিমা ইব্রাহিমের প্রবন্ধ থেকে একাধিক গ্রন্থ বর্তমানে প্রকাশের প্রক্রিয়াধীন রয়েছে।"),
                        ),
                      ],
                    ),
                  ),
                  const SizedBox(
                    height: 50,
                  ),
                  Container(
                    height: 60,
                    color: Colors.black,
                    child: const Center(
                      child: Text(
                        "Copyright 2024, All Rights Reserved",
                        style: TextStyle(
                            color: Colors.white, fontWeight: FontWeight.bold),
                      ),
                    ),
                  ),
                ],
              ),
            );
          }
        },
      ),
    );
  }
}
