import 'package:flutter/material.dart';
import 'package:ni_last/english_pages/mem.dart';


import '../homePage.dart';
import 'activities.dart';
import 'contact.dart';
import 'gallery.dart';
import 'lifeStoryPage.dart';
import 'media.dart';
import 'news.dart';
import 'publish.dart';

class Memories extends StatefulWidget {
  const Memories({super.key});

  @override
  State<Memories> createState() => _MemoriesState();
}

class _MemoriesState extends State<Memories> {
  late List<Widget> appBarItem;

  @override
  void initState() {
    super.initState();

    appBarItem = [
      const SizedBox(
        height: 100,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const LifeStoryPage(),
              ),
            );
          },
          child: const Text(
            "জীবনের গল্প",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Activities(),
              ),
            );
          },
          child: const Text(
            "কার্যক্রম",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Publish(),
              ),
            );
          },
          child: const Text(
            "প্রকাশনা",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Memories(),
              ),
            );
          },
          child: const Text(
            "স্মৃতিচারন",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Media(),
              ),
            );
          },
          child: const Text(
            "মিডিয়া",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Gallery(),
              ),
            );
          },
          child: const Text(
            "গ্যালারি",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const News(),
              ),
            );
          },
          child: const Text(
            "সমাচার",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
      const SizedBox(
        height: 10,
      ),
      Flexible(
        child: TextButton(
          onPressed: () {
            Navigator.push(
              context,
              MaterialPageRoute(
                builder: (context) => const Contact(),
              ),
            );
          },
          child: const Text(
            "যোগাযোগ",
            style: TextStyle(
              color: Colors.blueAccent,
              fontSize: 16,
            ),
          ),
        ),
      ),
    ];
  }

  bool mobile = false;

  @override
  Widget build(BuildContext context) {
    mobile = MediaQuery.of(context).size.width > 1000 ? false : true;
    return Scaffold(
      appBar: AppBar(
        toolbarHeight: 100,
        // leading: mobile ? null : Row(children: appBarItem),
        actions: [
          TextButton(
              onPressed: () {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                    builder: (context) => const Mem(),
                  ),
                );
              },
              child: Text("English   "))
        ],
        title: Column(
          children: [
            const SizedBox(
              height: 10,
            ),
            TextButton(
              onPressed: () {
                Navigator.push(
                  context,
                  MaterialPageRoute(
                    builder: (context) => const Homepage(),
                  ),
                );
              },
              child: const Text(
                "নীলিমা ইব্রাহিম",
                style: TextStyle(
                    color: Colors.blueAccent,
                    fontSize: 20,
                    fontWeight: FontWeight.bold),
              ),
            ),
            SizedBox(
              height: 50,
              child: Row(
                mainAxisAlignment: MainAxisAlignment.center,
                children: mobile ? [] : appBarItem,
              ),
            ),
          ],
        ),
        centerTitle: true,
      ),
      drawer: mobile
          ? Drawer(
              child: ListView(
                children: appBarItem,
              ),
            )
          : null,
      body: SingleChildScrollView(
        child: Column(
          children: [
            const Row(
              mainAxisAlignment: MainAxisAlignment.end,
              children: [
                Text(
                  "স্মৃতিচারন      ",
                  style: TextStyle(
                    color: Colors.blueAccent,
                    fontSize: 16,
                  ),
                ),
              ],
            ),
            const Column(
              children: [
                Text(
                  "\n\nআমার নীলিমা আপা"
                  "\n\n   কলিম শরাফী",
                  style: TextStyle(
                    color: Colors.blueAccent,
                    fontWeight: FontWeight.bold,
                    fontSize: 18,
                  ),
                ),
              ],
            ),
            const Padding(
              padding: EdgeInsets.all(60.0),
              child: Column(
                children: [
                  Text(
                      "আজকে যে মহতী নারী সম্পর্কে কিছু বলতে ইচ্ছা করছে তিনি আমার নীলিমা আপা–ড. নীলিমা ইব্রাহিম। বিদগ্ধ শিক্ষাবিদ হিসেবে তিনি আমাদের প্রায় সকলের কাছেই সুপরিচিত। আমি তাকে একটু ভিন্ন ভাবে দেখার সুযোগ পেয়েছি। তাঁর সাথে আমার বয়সের যে ব্যবধান ছিল সে তৎপ্রেক্ষিতে আমাদের সম্পর্কটা যেমনটি হওয়ার কথা তেমন ছিল না। তিনি আমার সাথে অগ্রজার অধিকার নিয়ে কথা বলতেন। তাঁর যে দরদী মন ছিল তা শুধু আমাদের সমাজে অবহেলিত নারীর জন্যই নয়, তা ছিল সকলের জন্য। তিনি শিক্ষা বিস্তারে যেভাবে নিরলস নিয়োজিত থাকতেন তেমনি করেই সমাজের সার্বিক মঙ্গলের জন্য কাজ করেছেন। দেশের সকল সম্প্রদায়ের মানুষের সম্মিলিত প্রয়াসেই অগ্রগতি সম্ভব তিনি তা বিশ্বাস করতেন। আমি শুধু অবহেলিত, নির্যাতিত নারী সমাজের জন্য তাঁর যে দরদ ছিল সে কথাই উল্লেখ করব। ৭১-এর মহান মুক্তিযুদ্ধে আমাদের নারী সমাজের উপর পাকিস্তানি দখলদার বাহিনীর যে নিমর্ম নির্যাতন নেমে এসেছিল মুক্তিযুদ্ধের অনতিকাল পরে তাদের জন্য নীলিমা আপার মহৎ হৃদয় কেঁদে উঠেছিল। তিনি তাদের পাশে গিয়ে নাড়ান এবং তাদেরকে সাহসের সাথে সমাজে মাথা উঁচু করে পাঁড়াবার আহ্বান জানান। শুধু তাই নয় তিনি নির্যাতিত মা-বোনদের বীরাঙ্গনা হিসাবে আখ্যায়িত করেন। বঙ্গবন্ধুর সাথে তাঁর ঘনিষ্ঠ সম্পর্কের কারণে তিনি তাঁর প্রচেষ্টায় প্রভূত। সাফল্য লাভ করেন। নির্যাতিতা মা-বোনদের পুনবার্সনের জন্য তিনি বিভিন্ন পদক্ষেপ গ্রহণ করেন। শুধু লেখালেখির মাধ্যমেই নয় বাস্তব ক্ষেত্রে তাঁর ন্যায় বিদুষী নারীর ঐ উদাম প্রয়াস সমাজে নির্যাতিতা নারীদের জন্য অনুকল পরিবেশ সৃষ্টিতে যথেষ্ট সহায়ক হয়। আমি আজ কৃতজ্ঞতার সাথে এই মহিয়সী নারীর অবদান স্মরণ করি। এদেশের নারী জাগরণের অন্যতম পুরোধা নীলিমা ইব্রাহিম বেঁচে থাকবেন সকল অবহেলিত নির্যাতিত মা-বোন এবং আমাদের সকলের হৃদয়ে।"),
                ],
              ),
            ),
            const SizedBox(
              height: 100,
            ),
            const Column(
              children: [
                Text(
                  "\n\nনীলিমা ইব্রাহিম : 'বেগম'কে করেছেন সমৃদ্ধ"
                  "\n\n                   নূরজাহান বেগম",
                  style: TextStyle(
                    color: Colors.blueAccent,
                    fontWeight: FontWeight.bold,
                    fontSize: 18,
                  ),
                ),
              ],
            ),
            const Padding(
              padding: EdgeInsets.all(60.0),
              child: Column(
                children: [
                  Text(
                      "১৯৫০ সালে আমরা ভারত থেকে এদেশে আসি।। বাবা জনাব নাসিরউদ্দিন সংস্কৃতিমনা একজন কাজী ব্যক্তিত্ব। ইতোমধ্যে নজরুল ইসলাম, আব্বাসউদ্দিন, জসীমউদ্দিন এর সঙ্গে হৃদাতা গভীর হয়েছে তার। কাজেই সাহিত্য ক্ষেত্রে তৎকালীন পূর্ব পাকিস্তানে একটা কিছু করা দরকার বিশেষ করে মহিলাদের জনা-এসব ভেবেই প্রকাশিত হ’ল ‘বেগম’ পত্রিকা। ১৯৫৪ সালে প্রতিষ্ঠিত হ’ল ‘বেগম ক্লাব’।"
                      "\nমূলত এই ক্লাবই তৎকালীন সময়ে শুধু মহিলাদের নয়, নারী-পুরুষ উভয়ের সাংস্কৃতিক চিন্তা- চেতনা-ধ্যান-ধারণার কেন্দ্রবিন্দুতে পরিণত হ’ল এবং সেখানেই আমি প্রথম ড. নীলিমা ইব্রাহিমের সংস্পর্শে আসি।"
                      "\nরাজিয়া বানু, হুসনা বানু খানম, লায়লা সামাদ কামরুন নাহার লাইলী-পুলু বিলকিস বানু এরা সবাই তখন ‘বেগম’ পরিবারভুক্ত। যুক্ত হলেন এদেরই একজন হয়ে নীলিমা আপা। আগেই উল্লেখ করেছি। এই ‘বেগম’ ক্লাব তখন শিক্ষিত সংস্কৃতিমনা মানুষের মিলন স্থান হয়ে উঠেছিল সেকারণেই প্রচুর অনুষ্ঠান, সংবর্ধনা ক্লাবের পক্ষ থেকে আয়োজন করতে হত। এবং সব কিছুর মূলেই থাকতেন নীলিমা আপা।"
                      "\nবাবা নাসিরউদ্দিনকে দেখেছি কিভাবে কি করতে হবে তা আপাকে বুঝিয়ে দিয়েছেন। ‘নীলিমা অনুষ্ঠানটি এভাবেই সাজাও’। আপা ঠিক ঠিক মত বাবার নির্দেশ মেনে নিজের মনের ও জ্ঞানের উৎকর্ষ দিয়ে চমৎকার সব অনুষ্ঠান নিজে নিজে সাজিয়ে পরিচালনা করতেন। বিশেষ করে নর্থব্রুক হল রোডের বাড়িটি বেগম ক্লাবের কাছাকাছি হওয়ায় আমার বাবা সবসময় তাঁকে কাছে পেয়েছেন। আরো একটি বিষয়ে লক্ষ্য করেছি। যখনই বিদেশী অতিথিকে সংবর্ধনা দেওয়া হ’ত তখন একমাত্র ড. নীলিমা ইব্রাহিম-ই পারতেন ইংরেজীতে সব কিছু পরিচালনা করতে। তখন তেমন অনেকেই ইংরেজী বলতে লিখতে পারদর্শী না হওয়ায় নীলিমা আপাই দারুণ দক্ষতায় বিদেশী অতিথিদের সঙ্গে কথোপকথন চালাতেন। বাবাও নিশ্চিত মনে আপার উপর সব দায়িত্বভার অর্পণ করতেন।"
                      "\nনীলিমা আপা ছিলেন একজন দৃঢ় চিত্ত কঠোর নীতি সম্পন্ন বিরল চরিত্রের একজন মহিলা। সবসময় খেয়াল করেছি তিনি যে সিদ্ধান্তটি নিতেন সেটাই বাস্তবায়ন করতেন। এমনও হয়েছে সাভার ভিন্ন মত উঠেছে কিন্তু তিনি তাঁর স্বভাবগত ভঙ্গীতে বলতেন “দেখো বিষয়টি তোমরা ঠিক বুঝতে পারছো না, এটি এমন হওয়া উচিত। কেন তা হওয়া উচিৎ তা বিশদভাবে ব্যাখ্যা করে শেষ পর্যস্ত তিনি তার মতের স্বপক্ষে সকলকে টেনে নিয়ে। আসতেন। অত্যন্ত বিচক্ষণ ও কৌশুলি হলেই এমনটা সম্ভব ব’লে আমার ধারণা।"
                      "\nশামসুন্নাহার মাহমুদ, সারা তৈফুর, মাহমুদা খাতুন সিদ্দিকা, সুফিয়া কামাল এঁরা এদেশের সম উন্নয়নে যে ভূমিকা রেখেছিলেন তা বলাই বাহুলা। কিন্তু নীলিমা ইব্রাহিম ছিলেন এঁদের থেকে একেবারে আলাদা। তিনি অনেককে পিছনে ফেলে অনেক দূর এগিয়ে গিয়েছিলেন তাঁর ব্যক্তিগত জ্ঞান ও প্রজ্ঞাকে সম্বল করুণ। অনেক বেশী আধুনিক ছিলেন তিনি, এটা আমাদের স্বীকার করতেই হবে। সত্যনিষ্ঠ, ন্যায়নিষ্ঠ এবং প্রখর বুদ্ধি সম্পন্ন নীলিমা ইব্রাহিম যেন একটি বিরাট বৃক্ষ, যার ছায়াতলে এদেশের শুধু মেয়েরা নয়- ছেলেরাও নিশ্চিত আশ্রয় লাভ করেছেন।"
                      "\nস্বাধীনতার পরও দেখেছি তিনি কি দক্ষতার সঙ্গে রোকেয়া হলের প্রাধ্যক্ষার দায়িত্বপালন করেছেন, এ পর্যন্ত বাংলাদেশের ইতিহাসে প্রথম মহিলা মহাপরিচালক হিসাবে বাংলা একাডেমীর সুনাম ও অক্ষুণ্ণ রেখেছেন। তবে এটাও ঠিক, বাংলাদেশের (তৎকালীন পূর্ব পাকিস্তান) বাংলা বিভাগের প্রথম মহিলা পি. এইচ. ডি. ডিগ্রীধারী নীলিমা ইব্রাহিমকে আমরা সংবর্ধনা দিই নি কখনো বেগম ক্লাবের পক্ষ থেকে। তবে বাবা অত্যন্ত উৎসাহের সঙ্গে তাঁকে “নাসিরউদ্দিন স্বর্ণ পদকে ভূষিত করেছিলেন স্বাধীনতার পর। আপাকে এ সম্মাননা প্রদান আমার বাবার পক্ষ থেকে পালিত একটি মহান কীর্তি বলে আমি মনে করি।"
                      "\nপঞ্চাশের শেষ কিংবা ষাট দশকের প্রথম দিকে। একটি স্মৃতি মনে পড়ছে। মাসুদা চৌধুরী (এখন আমেরিকা প্রবাসী) একদিন এসে জানালো ‘দেবদাস’ নাটকে সে অভিনয় করছে তবে ঐ সময়কার পোশাক-পরিচ্ছদ পাওয়া যাচ্ছে না। তিনি জানালেন, নীলিমা আপার কাছে তা পাওয়া যেতে পারে কারণ ওরকম ধরনের অভিজাতি শাড়ি তাঁকে তারা পরতে দেখেছে। আপা অত্যন্ত আন্তরিকতার সঙ্গে জানালেন কাপড় পাঠিয়ে দেবেন। পরবর্তীতে সেই শাড়িগুলো পরেই মাসুদা ‘দেবদাস’ নাটকে অভিনয় করেছিল। আপা ছিলেন এক আদর্শ। কথা বার্তায় কি চৌকস! এ দেশের স্বাধিনতা উত্তর নাট্য আন্দোলন তো অঙ্কুরেই শেষ হয়ে যেত, যদি না মহিলা সমিতির মঞ্চ পাওয়া যেত। যেমন লেখাপড়ায় উজ্জ্বল, তেমন সমাজ সেবার তাঁর অবদান। কি যুক্তি, কি প্রজ্ঞা। একই সঙ্গে নিজ মত প্রতিষ্ঠান, লাভ বলিষ্ঠ। এতগুণে গুণান্বিত একজন মহিলা কাজ করতে করতেই চলে গেলেন। অসুস্থ হয়ে বেঁচে থাকার চাইতে কর্মক্ষম অবস্থায় পৃথিবীকে বিদায় বলার মধ্যে বিজয়ী হবার গৌরব আছে অন্তত নীলিমা আপার জীবন দেখে আমার তাই মনে হয়। তবে এও মনে হয়, আপার মূল্যায়ন এখনো হয় নি। ঢাকা বিশ্ববিদ্যালয়ের ছাত্র/ছাত্রীদের হৃদয় জয় করা শিক্ষিকা কিংবা সমাজ সংস্কারক নীলিমা ইব্রাহিমকে এদেশ এখনো যথাযথ ভাবে পরিমাপ করতে পারেনি। আমাদের ইচ্ছে রয়েছে ‘বেগম ক্লাব এর ভূমিকা সম্পর্কিত গবেষণাকালে ড নীলিমা ইব্রাহিমের ভূমিকাও বস্তুনিষ্ঠভাবে তুলে ধরার। যে ক’জন মুষ্টিমেয় নারীর অবদান এদেশকে সমৃদ্ধ করেছে তাদের মধ্যে নীলিমা ইব্রাহিমের নাম অবশ্যই প্রথম সারিতে। ‘বেগম’ পত্রিকাকে তিনি লেখা দিয়ে সবসময় সমৃদ্ধ করেছেন। তার প্রথম উপন্যাস ‘পথ- শ্রান্ত ১৯৫৫ সালে ‘বেগম’ এ প্রকাশিত হয়। আমরা সবক্ষেত্রে তাঁর সাহায্য সহযোগিতা পেয়েছি বড় আন্তরিকভাবে। নীলিমা ইব্রাহিম শুধু একটি নাম নয়- আমার মতে তিনি একটি ‘প্রতিষ্ঠান।’ নিজেকে একটি প্রতিষ্ঠানে পরিণত করার জন্য যে দৃঢ় মানসিকতা, জ্ঞান ও বুদ্ধিমত্তার প্রয়োজন ড. নীলিমা ইব্রাহিম সে সব গুণকে নিজ যোগ্যতায় ধারণ করে তাঁর যথার্থ প্রয়োগে সক্ষম হয়ে ছিলেন। বাঙ্গালী নারী সমাজ চিরকাল এই ব্যক্তি মানুষটি তথা একটি চৌকস! এ দেশের স্বাধীনতা উত্তর নাটা আন্দোলন প্রতিষ্ঠানের কাছে চির ঋণী হয়ে থাকব।"),
                ],
              ),
            ),
            const Column(
              children: [
                Text(
                  "নীলিমা আপা বান্ধব হলেন\n"
                  "       গাজীউল হক",
                  style: TextStyle(
                      fontWeight: FontWeight.bold,
                      color: Colors.blueAccent,
                      fontSize: 18),
                ),
              ],
            ),
            const SizedBox(
              height: 50,
            ),
            const Column(
              children: [
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      "মুক্তিযুদ্ধকালে মুক্তিযোদ্ধাদের মধ্যে একটা গুজব ছড়িয়ে পড়েছিল। অধ্যাপিকা নীলিমা ইব্রাহিম হানাদার পাকিস্তানি বাহিনী কর্তৃক নিহত হয়েছেন। কিন্তু গুজবটির সত্যতা যাচাই, করার উপায় ছিল না। অবশ্য অনেকেই কিন্তু বিশ্বাস করেছিলেন গুজবটা সত্য বলে। কারণ গোবিন্দ দেব, অধ্যাপক সন্তোষ বাবু এবং জ্যোতির্ময় গুহঠাকুরতার হানাদার বাহিনীর হাতে নির্মম হত্যাকাণ্ডের সংবাদ শোনার পর নীলিমাদির মৃত্যু সংবাদও অনেকে সত্য বলে মেনে নিয়েছিলেন। বাংলাদেশ স্বাধীনতা লাভের পর এদেশে ফিরে এসে শুনেছিলাম এটা শুধু রটনা ছাড়া কিছু নয়। শত্রুর মুখে ছাই দিয়ে নীলিমাদি এখনো বেঁচে করেছেন। মুক্তিযুদ্ধ চলাকালীন সময়ে পাক বাহিনীর হাতে লাঞ্ছিতা মহিলাদের সমাজে পুনর্বাসনের দায়িত্ব নিয়ে কাজ শুরু করেছিলেন মুক্তিযুদ্ধের পর পরই। তাঁর স্নেহ-কর-স্পর্শে অনেক লাঞ্ছিতার জীবনের জ্বালার উপশম হয়েছে। মাতৃস্নেহে তিনি তাঁদের সকলকে কাছে ডেকে নিতেন। সমাজে পুনর্বাসনে সাহায্য করেছেন। বলতেন মনের মতো একটি কাজ পেয়েছি বটে। কিন্তু তিনি বেশি দিন এই কাজ করতে পারেন নি। তাঁর ডাক পড়েছিল বাংলা একাডেমীকে গড়ে তুলতে। সুতরাং বঙ্গবন্ধুর সেই ডাকে সাড়া দিয়ে তিনি বাংলা একাডেমীর মহাপরিচালকের দায়িত্ব নিয়ে বাংলা একাডেমীতে যোগ দেন।"),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      "বাংলা একাডেমীতে তখন চলছিল অনিয়ম বিশৃঙ্খলা। দৃঢ় হাতে তিনি সেই সময় এই সব অনিয়ম দূর করেছিলেন। আমি তখন বাংলা একাডেমীর আইন উপদেষ্টা হিসেবে কাজ করছি। একদিন তিনি আমাকে ডেকে পাঠালেন বাংলা একাডেমীতে তাঁর অফিস কক্ষে। কেন ডেকে পাঠিয়েছেন জানতে চাইলে বললেন মকবুল নামের উক্ত খাদেমকে কী করে বাংলা একাডেমীর চতুর থেকে তাড়ানো যায়। মকবুল নামের এই ভদ্রলোকটি বাংলা একাডেমীর উত্তর-পূর্ব কোণের একটি জানা দখল করেছে এবং ধীরে ধীরে তার দখলের এলাকা বিস্তৃত করে যাচ্ছে। আইন আদালত করেও তাকে বাধা দেয়া যাচ্ছে না। মামলাবাজ এই লোকটি বাংলা একাডেমীর কিছু লোককে হাত করেছে প্রলোভন দেখিয়ে। এমনকি সরকারের অনেক উঁচু পর্যায়ের লোকও তার ওখানে যাতায়াত করে। কেউ করে ইহজাগতিক লোভে আবার কেউ করে মৃত্যুর পরে বেহেশতে এক টুকরো জমির জনো। এই জমির অধিকারী হওয়া ছিল অত্যন্ত সহজ এবং মামুলি ব্যাপার। মাহফিলের মোনাজাতের মাধ্যমে দোয়া পরিচালনাকারী মৌলবী সাহেব এই সমস্ত জায়গার বিলিবণ্টন করতেন। যদি তা নাও পারতেন তবুও চেষ্টা করতেন অন্তত হাত উঠানো মোনাজাতকারীদের কবরবাসী পিতৃপুরুষদের কবরগুলোকে বেহেশতের বাগিচায় পরিণত করার কঠিন কাজটুকু করে দিতে। মৌলবীর এই কথা বিশ্বাস করে প্রতি বৃহস্পতিবার মোনাজাতে প্রচুর লোক সমাগম হতো এই অজ্ঞাত পীরের আস্তানায়। প্রথমে ছিল একটি কবর এবং তাঁর পাশে মাত্র চার শতক জায়গা। মকবুলের বাংলা একাডেমীতে তখন চলছিল অনিয়म হাতের কারসাজিতে তা বেড়ে হয়ে গেল একশ চুয়াল্লিশ শতক। আর একটু চুপ করে থাকলে এই জায়গা আরো বেড়ে বাংলা একাডেমীকে গ্রাস করবে। সুতরাং সময় থাকতেই ব্যবস্থা নিতে হবে। আইনি বা বেআইনি যে কোন ব্যবস্থা নিয়ে মকবুলকে বা তার মতো ধর্মব্যবসায়ীদের বাংলা একাডেমী ছাড়া করতে হবে। বললাম আইনের মাধ্যমে আইনের সাহায্যে কোনো কিছু হবে না। কারণ বাংলা একাডেমীর অনেকখানি জায়গা সে ইতিমধ্যেই দখল করে নিয়েছে। সুতরাং কিছু বেআইনি সাহায্য নেওয়ার প্রয়োজন হবে। আরো বললাম, প্রয়োজনবোধে রক্ষীবাহিনীর সাহায্য নেয়া যেতে পারে। বিশেষ করে যখন রক্ষীবাহিনী ঢাকা শহর থেকে অবৈধ স্থাপনা উচ্ছেদের কাজে নিয়োজিত হয়েছে। সব শুনে নীলিমা আপা বললেন, ঠিক আছে ভাই, তাই হবে। আমি রক্ষীবাহিনীর সাহায্য চেয়ে পাঠাচ্ছি, কিন্তু উচ্ছেদের কাজ যখন হবে তখন আপনাকে প্রয়োজনবোধে আইনি সাহায্য দানের জন্য আমার পাশে থাকতে হবে।"),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      "কয়েকদিন পর একদিন জরুরি ভিত্তিতে ডেকে পাঠালেন। অফিসে গিয়ে দেখি রক্ষীবাহিনীর একজন উচ্চ পর্যায়ের কর্মকর্তা বসে আছেন। তাকে বললাম আইন করে কিছু হবে না বলেই তাদের সাহায্য চেয়েছি। কারণ একটি মোকদ্দমা জিতলে মকবুল তিনটি মোকদ্দমা রুজু করে দেয় এবং কোর্ট নিষেধাজ্ঞার আদেশ এনে উচ্ছেদের কাজ বন্ধ করে দেয়। সুতরাং মকবুলকে শুধু জায়গা থেকে উচ্ছেদ করলেই চলবে না, তার বেড়া টিন ঘরের সরঞ্জামাদি দূরে অন্যত্র কোথাও পাঠিয়ে দিতে হবে। পরামর্শ মতো রক্ষীবাহিনীর লোকজন এল, ট্রাক এল, এবং পরামর্শ মতোই মকবুলের ইচ্ছা অনুসারে ট্রাকে তাঁর মালপত্র সরিয়ে দেওয়া হল তার পছন্দ মত জায়গা মিরপুরে। সব শেষে মকবুলকে ট্রাকে তুলে মিরপুরেই পাঠিয়ে দেওয়া হল। সেদিন মকবুলের কাছে পাওয়া গিয়েছিল ১৪২টি তালার চাবি। মকবুলের ছিল। একশত বিয়াল্লিশটি চাদা আদায়ের বাক্স। শহরের ভিন্ন ভিন্ন স্থানে এবং শহরের বাইরেও এই বাক্সগুলো রক্ষিত ছিল। এর তত্ত্বাবধান করত এক সুসংগঠিত দল। তারা চানার ভাগ নিত এবং বাক্স পাহারা দিত। কিন্তু মকবুলের অবৈধ বাসা ভেঙে দেওয়ার পর এই বাক্সের তালা আর সে খুলতে পারে নি।"),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'পাহারাদারেরাই সেই বাক্সগুলো দখল করে নিয়েছে। পরে নীলিমানি প্রায়ই হেসে বলতেন উচ্ছেদ করতে হলে মূলসুদ্ধই উপড়ে ফেলতে হয়। সেদিন নীলিমানির এক ভিন্নরূপ দেখেছিলাম। প্রয়োজনে কি কঠিনই না হতে পারেন তিনি!'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'আর একবার তাঁর এই রূপ দেখেছিলাম। সেইবার আইনের দরবারে তিনি গিয়েছিলেন বিচারপ্রার্থী হয়ে। বেগম খালেদা জিয়ার প্রধানমন্ত্রিত্ব কালের শেষ ভাগে নীলিমা আপার নামে একটি মোকদ্দমা দায়ের করা হয়েছিল মানহানির অভিযোগসহ কয়েকটি মিথ্যা অভিযোগে। আমার ভাগ্নীরা (নীলিমাদির দুই মেয়ে) এলেন, আমাকে তাঁর পক্ষে দাঁড়াতে হবে। হাইকোর্ট থেকেই জামিনের ব্যবস্থা করতে হবে। নিম্ন আদালতে জামিন না পাওয়ার সম্ভাবনা বেশি। সুতরাং হাইকোর্টেই জামিনের আবেদন দাখিল করতে হবে। সমস্ত প্রস্তুতি নিয়ে হাইকোর্টে দরখাস্ত নিয়ে হাজির হলাম। বিচারকক্ষ জনাকীর্ণ আগাম জামিনের মোকদ্দমার ফলাফল জানার জন্য। দুইজন বিচারপতি এসে এজলাসে বসলেন। বিচারকক্ষে পিনপতন নিস্তকতা। জামিনের দরখাস্ত পেশ করতেই বললেন, এই মোকদ্দমার জামিনের দরখাস্ত মহানগরীর মুখা হাকিমের কাছে করতে হবে। এখানে তো এর শুনানি হবে না। আমরা অবাক হলাম কথাটা শুনে। কয়েকদিন আগেই হাইকোর্টের এই বেঞ্চ খুনের মোকদ্দমায় আগাম জামিন দিয়েছিলেন। সেই কথাটা তুলে ধরতেই বললেন এটা ছিল খুনের মোকদ্দমা, সেই জন্যই জামিন দিয়েছিলাম। নিম্ন আদালতে জামিন নাও দিতে পারত সেই জনা জামিন দিয়েছি। কিন্তু এই মোকদ্দমায় তো নিম্ন আদালতে জামিন না হওয়ার কোনো কারণ নেই। মনে হয় বলেছিলাম নিশ্চয়ই কারণ আছে। কারণ সাধারণ মোকদ্দমায়। অভিযুক্ত নীলিমা ইব্রাহিমকে ধরার জন্য রাতে। বাড়িতে দুই বার হানা দিয়েছিল, সে জন্য আমরা আশঙ্কিত তার মতো সম্মানিতা মহিলাকে হয়তো কোর্টে যাওয়ার পথে পুলিশ গ্রেফতার করতে পারে এবং ঐখানে হাজির হলে আদালত জামিন না দিয়ে তাকে জেলে পাঠাতে পারেন। এই অসুস্থ শরীরে তাঁকে গ্রেফতার করা বা জেলে পাঠানো তার স্বাস্থোর মারাত্মক হতে পারে, কিন্তু হাইকোর্ট বিচারপতি অনমনীয় মনোভাব প্রকাশ করে জামিনের দরখাস্ত ফেরত দিলেন। আওয়ামী লীগের শাসনামলে বঙ্গবন্ধু কর্তৃক নিযুক্ত জজ সাহেব জামিনের আবেদন শুনানী না করতে পারেন, তা ধারণার বাইরেই ছিল। জামিনের দরখাস্ত ফেরত নিয়ে আমার ২২নং কক্ষে গিয়ে পুনরায় খসড়া তৈরী করে মহানগরীর মুখ্য হাকিমের এজলাসে হাজির হলাম। দরখাস্ত দিতেই তিনি যেভাবে দরখাস্ত গ্রহণ করলেন তাতে মনে হচ্ছিলো ব্যাপারটা পুরোপুরি জানেন। এখনই আদেশ দিয়ে দেবেন। কিন্তু কার্যত দেখা গেল। তিনি কিছুক্ষণের কথা বলে এজলাস ছেড়ে চলে গেলেন নিজের বিশ্রাম কক্ষে। সেখানে কথা বলতে শুরু করলেন কোনো এক ব্যক্তির সঙ্গে। ঠায় বসে রইলাম। এজলাসে শতাধিক আইনজীবী উপস্থিত এবং অধিকাংশই (সরকার পক্ষের বা বেসরকারি) নীলিমাদির জানা। অনেকে বললেন বোধহয় জামিন দেবেন না, সেই জন্য টালবাহানা করছেন। বিচারকক্ষে সমস্ত আইনজীবী উত্তেজিত। এমনি সময়ে এলেন পাবলিক প্রসিকিউটর (সরকার পক্ষীয় এডভোকেট)। তিনি এসে কোন ভণিতা না করেই বললেন হাকিমের এই ভণিতার কি আছে।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      "ম্যাজিস্ট্রেট সাহেবকে এজলাসে বসে বার নিতে বলো। এই কথা বলার সময়েই ম্যাজিস্ট্রেট এজলাসে এলেন এবং আসা মাত্র বি পক্ষীয় আইনজীবী কোনো প্রকার ভূমিকা না করে বললেন আমি নীলিমা ইব্রাহিমের জামিনের দরখাস্তের বিরোধিতা করি না। মাননীয় হাকিম তাকে জানিন দিতে পাবেন। জামিন দিলেন ম্যাজিস্টেট অবশ্যই কিন্তু কিছুক্ষণের জন্য হলেও নীলিমা আপাকে আসামির কাঠগড়ায় দাঁড়াতে হলো। তবু মনে হলো। হাফ ছেড়ে বাচলাম। কিন্তু নীলিমা আপার কোনো বিকার নেই। কোন চিন্তার রেখা তাঁর মুখে ফু বুঝলাম পাথরে গড়া মানুষ। এ মানুষ ভাগতে পারে কিন্তু মচকাতে জানে না। হাত ধরে যখন তাঁর কয়েক শত আইনজীবীসহ আদালত প্রাঙ্গণ থেকে বেরিয়ে আসছিলাম, তখন হাতে মৃদু চাপ দিয়ে বলেছিলেন, দু’ভাই বোন রাজঘারে একসাথে হাজিরা দিয়েছি, আজ থেকে আপনি আমার আর ভাই নন বান্ধব।"),
                ),
                SizedBox(
                  height: 50,
                ),
                Text(
                  'নীলিমা আপাকে শ্রদ্ধার্ঘ্য\n'
                  '     কামাল লোহানী',
                  style: TextStyle(
                      fontWeight: FontWeight.bold,
                      color: Colors.blueAccent,
                      fontSize: 18),
                ),
                SizedBox(
                  height: 50,
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'বাংলাদেশে যারা সাম্প্রদায়িকতার বিরুদ্ধে সোচ্চার, নারী নিপীড়নকে রুখে দেয়ার আন্দোলন সংগঠনে তৎপর ছিলেন বক্তৃতায়, লেখনীতে কিংবা ভাষণে — নীলিমা ইব্রাহিম এমনই সত্যভাষী, নিষ্ঠাবান ব্যক্তিত্ব। মুখের উপর কথা বলে দেবার সাহস ছিল তাঁর। অন্যায়কে প্রশ্রয় দেয়া কখনই সইতে পারতেন না। প্রতিবাদ করতেন। তবে কখনও যে মেনে নিতে না পারলেও অনেক কিছুরই প্রতিক্রিয়া নীরব থেকে প্রকাশ করতে চেয়েছেন, তা কাছের যারা তারা স্পষ্টতই জানতেন। ডক্টর নীলিমা ইব্রাহিম ছিলেন শিক্ষাবিদ, লেখক এবং প্রগতিশীল জাতীয়তাবাদী সাহিত্যধারার নেত্রী, মুক্ত চিন্তায় বিশ্বাসী। তার ধীশক্তি আর রসবোধ যে কোনো আসর-আড্ডাকে জমিয়ে তুলতো। দেশাত্মবোধ তাকে মহত্ত্ব দান করেছে। অনমনীয় দেশপ্রেম তাকে কাজে ও লেখায় উদ্বুদ্ধ করেছে আজীবন। লেখার জন্য তাকে জেলে যেতে হয়নি বটে কিন্তু আদালতের দ্বারস্থ হতে হয়েছিল।'
                      ''),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'অধ্যাপক নীলিমা ইব্রাহিম নামটি উচ্চারিত হলেই প্রাসঙ্গিকভাবেই আরেকজন নির্লোভ স্বল্পবাকা সুদর্শন মানুষের দীর্ঘাঙ্গ চেহারা চোখে ভেসে ওঠে তিনি হলেন ডা. মোহাম্মদ ইব্রাহিম। এই জোড়া সাতারটি বসন্ত পেরিয়ে দুজনে কুজনে কাটিয়ে দিয়েছেন দিবস রজনী। অনাবিল আনন্দময় জীবনযাপনে যেমন তাঁদের জুড়ি ছিল না, তেমনি পারিবারিকভাবে পাঁচ কন্যার কোলাহলমুখর দিনযাত্রার পুঁথিপাঠ যেন মধুময় মানববন্ধনকেই প্রকাশ করেছে নিরবধি। এই যাত্রাপথে মানুষ মাত্রেরই তো উত্থান আছে, পতন আছে। আছে দুঃখ, আছে আনন্দ্য সেখানেও তার ছিল না ক্ষোভ।কিংবা যন্ত্রনা থাকলেও কেউ কি কখনও দেখেছে? বৈঠকখানায় বসলে কি রকম উজ্জ্বল-উচ্ছল হয়ে উঠতেন, তা হয়তো তাঁর প্রিয়জন ছাত্র-শিক্ষক- বন্ধু- স্বজন- প্রীতিভাজন সবাই জানতেন এবং দেখেওছেন। বিস্তৃত বক্ষ হৃদয়বান মানুষ ঐ ডা. ইব্রাহিমকে পেয়ে নীলিমা আপা বোধহয় জীবনটাকে নিবেদন করতে পেরেছিলেন সাহিত্যে-সাংস্কৃতিতে কিংবা সমাজসেবায়। তোয়াক্কা করেননি কোনো বাধার। তার দারুন নির্ভরতা ছিল ঐ মানুষটির উপর যার সাথে সাতান্নটি বছর সুখেদুঃখে, আনন্দ-বেদনায়, লড়াইয়ে-সংগ্রামে কাটিয়ে দিয়েছেন নিশ্চিন্ত মনে। কী অনন্য চরিত্র! সবকিছুতেই সোজা হয়ে দাড়িয়ে আছেন, নিরুদ্বেগ। কিন্তু আজ যে তিনি সঙ্গীবিহীন একা! আর দুজনার মিলে দুজনার খাবার তৈরীর জন্য রান্নাঘরে যাবেন না। হয়তো ছোট মেয়ে কিছুদিন থেকে যে জোগান দিচ্ছিলেন, সেই এখন বাবার সঙ্গী হবে।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'নীলিমা আপা প্রচণ্ড সংবেদনশীল ছিলেন। মানুষের দুঃখে কাতর হতেন। আনন্দে কোনোদিন ভাগ বসাননি। তাই তো একাত্তরের মুক্তিযুদ্ধের সময় যে মা-বোনেরা সম্ভ্রম হারিয়েছেন পাকিস্তানি হানাদার হায়েনাগুলোর হাতে, তাদের নির্যাতন ও মর্মযাতনার কথা তুলে ধরতে তীক্ষ্ণ কলম হাতে এগিয়ে এসেছিলেন সাহসী নারীব্যক্তিত্ব শিক্ষাবিদ নীলিমা ইব্রাহিম। লিখলেন ‘আমি বীরাঙ্গনা বলছি’ এই নামে। এবং অসাধারণ গ্রন্থ। নীলিমা আপা আপনি তো চলেই গেলেন, এই বীরঙ্গনাদের আর কোনো খোজখবর কি কেউ নেবে? ওদের প্রতি আমাদের যে শ্রদ্ধাবোধ ও দায়-দায়িত্ব থাকা উচিত তা কি আমরা পেরেছি দেখাতে? আপনি মহানুভব। দেশকে ভালোবাসতেন। তাই দেশের জন্য ধরা ान দিয়েছেন, সেই সব বীর লড়াকুদের পাশাপাশি এঁদেরও একই আসন দেবার কী উদার ও সাহসী প্রতায় বাজ করেছিলেন! কিন্তু আপা, আপনি যখন শয্যা নিয়েছেন, তেমনি সময় অথবা তারও আগে। চলৎশক্তি হারাননি যখন, তখনও আপনি সামাজিক অনাচারের বিরুদ্ধে নারী আন্দোলন থেকে দেশ গঠনমূলক যে কোনো উদ্যোগে অংশ নেয়ার যে প্রয়োজনীয়তা অনুভব করতেন, তা সত্যিই সাহসের জোগান দেয়। আপনি কিশোরী হত্যা, শিশু ধর্ষণ, নারী অপহরণ—এসব কুৎসিত ও ভয়ঙ্কর সামাজিক অপকর্মের কথা শুনলেই ঘৃণায় কুঁকড়ে উঠতেন।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'নীলিমা আপা, আপনি তো চাইতেন না, অনেকেই চান না কিন্তু এমন ঘটনার পুনরাবৃত্তির খবর তো প্রকাশিত হচ্ছে প্রায় প্রতিদিনই। নীলিমা আপা, আপনি তো চলেই গেলেন কিন্তু এই যে বিড়ম্বনা, এ কেবল সহ্য করার মানুষ আমরা রয়ে গেলাম।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'এদেশের প্রতিষ্ঠাতা, একাত্তরে মুক্তিযুদ্ধের মহানায়ক বঙ্গবন্ধু শেখ মুজিবুর রহমানকে আপনি যে শ্রদ্ধা করতেন, তা পারস্পরিক সৌহাদ্যপূর্ণ সম্পর্কের ও ব্যক্তিগত সমঝোতার এক পরম দৃষ্টান্ত। শেখ মুজিবুর রহমান এমনই এক মহীরুহ ছিলেন, যাকে নিয়ে নীলিমা আপা শুধু গর্ববোধ করতেন তা নয়। তাঁর প্রতি অগাধ আস্থা নিয়ে দেশ ও জাতিকে নিজ ঐতিহ্য মহিমার গড়ে তোলার সুনির্দিষ্ট পথ চলার কথা ভাবতেন। কিন্তু পঁচাত্তরের নির্মম সামরিক সন্ত্রাস (শেখ মুজিব ও তাঁর পরিবারকে যেভাবে হত্যা করল, তারপর থেকেই শুরু হলো রাজনৈতিক সংঘাত আর সামরিক অভ্যুত্থানের পাল্টাপাল্টি। তবুও মুজিব- স্মৃতিচারণ করে নীলিমা ইব্রাহিম লিখলেন ‘অগ্নিস্নাত বঙ্গবন্ধুর ভস্মাচ্ছাদিত কন্যা আমি’ বইটি। ‘বেগম ফজিলাতুন্নেছা মুজিব’ ব্যক্তিগত প্রসঙ্গভিত্তিক আরেকটি গ্রন্থ তিনি রচনা করেছিলেন। এছাড়া বাংলা সাহিত্যের শিক্ষক ও গবেষক হওয়ায় সাহিত্যোপযোগী রচনা ‘সাহিত্য ও সংস্কৃতির নানা ‘বাঙালীমানস ও বাংলা সাহিত্য’, ‘শরৎ- প্রতিষা”, বাংলার কবি মধুসূদন’সহ বহু গ্রন্থ তিনি রচনা করেছেন। “অতঃপর অমানিশার অন্ধকার’ একটি তাৎপর্যপূর্ণ প্রকাশনা। তিনি সাহিত্যভিত্তিক গ্রন্থ গু ও অধ্যাপনা করে যে দিনাতিপাত করতেন না, তা আগেই আমরা জেনেছি। সমাজ-সংস্কৃতির অগ্রগতির প্রয়োজনে নীলিমা ইব্রাহিম নিজেকে নিয়েপন করেছিলেন বলে বিভিন্ন প্রকাশনা বিশেষ করে পত্রপত্রিকায় বহু লেখা লিখেছেন। রাজনীতি বিষয়ে কলামও লিখতেন। ঢাকা বিশ্ববিদ্যালয়ে সুদীর্ঘকাল বাংলা সাহিত্যের শিক্ষকতা করেছেন। বাংলা একাডেমীতে মহাপরিচালকের দায়িত্ব পালন করেছেন। অনেকদিন। সেই একাডেমীতে তাঁর মরদেহ নিয়ে। যাওয়া হয়েছিল কিন্তু একাডেমীর সভাপতি ও মহাপরিচালক দুজনার কেউই উপস্থিত ছিলেন না। উপস্থিত সকলের মধ্যে তাতে ক্ষোভের সঞ্চার হয়েছিলো।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'ড. নীলিমা ইব্রাহিম বাংলাদেশ পরিবার পরিকল্পনা সমিতি ও শিশু একাডেমীর সাথেও যুক্ত ছিলেন। বাংলাদেশ মহিলা সমিতির সাভানেত্রী থেকে এই প্রতিষ্ঠান পরিচালিত কর্মজীবী। মহিলা আবাস চালিয়েছেন। গড়ে তুলেছিলেন মহিলা। সমিতি মিলনায়তন। সত্যি কথা বলতে কি, তাঁর উৎসাহে এই মিলনায়তন মঞ্চে নিয়মিত নাটক উপস্থাপনার সুযোগ সৃষ্টি করে তিনি এ দেশের সাংস্কৃতিক আন্দোলনের ক্ষেত্রেও বিরাট অবদান। রেখেছিলেন। পরবর্তীকালে মহিলা সমিতি ভবনের উপর তলায় একটি সেমিনার কক্ষও চালু করেছিলেন। এবং সাহিত্য বা যে কোনো সৃজনশীল বিষয়ের চর্চার জন্য একে ব্যবহারের জন্য উন্মুক্ত করেছেন বেশ কিছুদিন হলো। আমি বাক্তি হিসেবে উল্লেখিত হলেও প্রামাণ্য তথা ও। ইতিহাস উপকরণহেতু বিষয়টি এখানে উল্লেখ করতে চাই। তা হলো ১৯৭১ সালের ১৬ ডিসেম্বর পাকিস্তানের পরাজয় এবং মুক্তিযুদ্ধের বিজয় অর্জিত হলো। আমরা মুজিবনগর সরকারের কর্মী হিসেবে ঢাকা ফিরে এলাম ২২ ডিসেম্বর। এই দিনই গণপ্রজাতন্ত্রী বাংলাদেশ সরকারের মন্ত্রিমণ্ডলও ঢাকা এলেন। ২৫ ডিসেম্বর প্রধানমন্ত্রী তাজউদ্দিন, আহমদ আমাকে বাংলাদেশ বেতারের ঢাকা প্রসঙ্গ’, স্টেশনের পরিচালনার দায়িত্ব দিলেন। কিন্তু সত্যি কথা বলতে কি, রীতিমতন মাবড়ে গেলাম। প্রোগ্রামের জন্য কাকে ডাকব আর কাকে ডাকব না, ভেবে কূল পাচ্ছিলাম না। এর মধ্যে একটি তালিকা পেলাম প্রায় পথনির্দেশের মতোই। অধ্যাপিকা নীলিমা ইব্রাহিম স্বাক্ষরিত শিল্পী, গায়ক। লেখক এবং কথকদের একটি তালিকা। এতে যাদের নাম দেখলাম, তাতে বিস্মিত হলাম না। ‘নীলিমা ইব্রাহিম। কমিটির পক্ষ থেকে বেতারে পাঠিয়ে দেয়া হয়েছে, এই তালিকাভুক্ত শিল্পী, সাহিত্যিক, শিক্ষক, সাংবাদিকরা কোনো প্রোগ্রাম যেন না করতে পারেন। সেদিন। যদি নীলিমা আপার নেতৃত্বে গঠিত কমিটি রচিত তালিকা হাতে না পেতাম, তবে বেশ বিপদেই পড়তে হতো।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'প্রসঙ্গ যখন আসলই, তখন আমার প্রতি তাঁর স্নেহদৃষ্টির কথা উল্লেখ করতে চাই। তবে বিষয়টি একেবারেই ব্যক্তিগত। সে হলো। স্বৈরাচারী এরশাদের পতনের পর তত্ত্বাবধায়ক সরকারের পরিচালনায় অনুষ্ঠিত জাতীয় নির্বাচনে বিএনপি জয়ী হয়ে সরকার গঠন করলো। পাঁচ বছর মেয়াদ শেষে নতুন নির্বাচনে আওয়ামী লীগ ক্ষমতায় অধিষ্ঠিত হলো। একদিন কোনো এক অনুষ্ঠানে নীলিমা আপার সাথে দেখা। হঠাৎ আমার দিকে তাকিয়ে আপা বললেন, “এই কামাল, তুমি এখনও এখানে কি করছ? তোমার তো শিল্পকলায় থাকার কথা’। আমি জবাবে বললাম, “কেন আপা ?’ আপা জোর দিয়ে বললেন, “তোমাকে ওখানেই যেতে হবে’—বলেই আমাকে তার সাথে যোগাযোগের কথা বললেন। কিন্তু যখন হলো না তখন স্নেহের বশবর্তী হয়ে আমাকেই তাঁর বার্থতার ক্ষোভ জানালেন। অন্য কাউকে বুঝতে দেননি তিনি।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'নীলিমা ইব্রাহিম আত্মবিশ্বাসী ছিলেন। আত্মাভিমানীও ছিলেন। যতই ভালো হোক, যদি কেউ তাঁর কথায় কর্ণপাত না করেন, তবে তিন নিজেই ক্ষোভে অভিমানে নিজের ভেতরই ফেটে পড়তেন। বহিঃপ্রকাশ যে ছিল না তা নয়। তবু ক্ষেত্রবিশেষে ক্ষোভকে দমনও করতেন তিনি।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'এই মহীয়সী নারীকে পুরস্কৃত করে তো কোনো নতুন সম্মান দেয়া যাবে না, বরঞ্চ নিজেরাই মহিমামান্বিত হতে পারি আমরা । তারপরও ক্ষুব্ধ প্রতিক্রিয়া আমার মতন অনেকের, তা হলো সাহিত্য, সংস্কৃতিসেবী সংগঠনমুখী ব্যক্তিত্ব ড. নীলিমা ইব্রাহিম কি একুশে কিংবা স্বাধীনতা পদক পাবার যোগ্যতা অর্জন করেননি ? তিনি পেয়েছেন বাংলা একাডেমী পুরস্কার পাকিস্তান আমলেই। ১৯৭৩-এ পেয়েছিলেন ‘জয়বাংলা পুরস্কার’ ভারত থেকে, মাইকেল মধুসূদন পুরস্কার’ ১৯৮৭ তে, ১৯৮৯ তে পেয়েছিলেন ‘লেখিকা সংঘের পুরস্কার। ১৯৯৬ সালে পেয়েছিলেন বেগম রোকেয়া পদক’ এবং অনন্যা সাহিত্য পুরস্কার। পুরস্কারের চেয়ে সম্মান ছিল তাঁর অপরিসীম। মানুষ অসীম শ্রদ্ধা জানিয়েছেন তাকে। ১৯২১ সালের ১১ অক্টোবর খুলনায় জন্মগ্রহণ করা এই কন্যার বালা কিংবা শিক্ষাজীবন দারুণ গৌরবোজ্জ্বল। ১৯৩৫ সালে চারটি বিষয়ে লেটার নম্বর নিয়ে ম্যাট্রিক পাশ করে কলকাতায় কলেজ জীবনের প্রথম ধাপ পার করেন বিজ্ঞান অধ্যয়নে। কিন্তু অনার্স পড়লেন অর্থনীতি বিষয়ে। ৪১ সালে, প্রথম শ্রেণী নিয়ে পাশ করলেন। মাস্টার্স দেয়া সম্ভব হলো না মায়ের অসুখের জন্য। ডা ইব্রাহিমের সাথে তাঁর বিয়ে সম্পন্ন হলো ১৯৪৫ সালে। এই দুজনার সেদিনের মধুর মিলন নীলিমা আপার প্রতিভাদীপ্ত জীবন অবসানের দিন পর্যন্ত অনুকরণীয় এক সম্পর্কের দৃষ্টান্ত রেখে গেলেন।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'নীলিমা ইব্রাহিম কলকাতা বিশ্ববিদ্যালয় থেকে বাংলা ভাষা ও সাহিত্যে প্রথম শ্রেণী পেয়ে মাস্টার্স শেষ করেছিলেন। কিন্তু ১৯৫১ সালে ঢাকা বিশ্ববিদ্যালয় থেকে নিয়েছিলেন ডক্টরেট ডিগ্রি প্রিয়ভাষিণী নীলিমা ইব্রাহিম ছাত্র-ছাত্রীদের কাছে ছিলেন জনপ্রিয়। বর্তমানের অনেক সাহিত্য অধ্যাপকই তাঁর ছাত্র ছিলেন। পরে কেউ কেউ সহকর্মীও হয়েছেন। দেশ ও জাতির সংকটে কিংবা কোনো অন্যায়ের প্রতিবাদে তাঁর কণ্ঠ ছিল অপ্রিয় ভাষণে সিদ্ধ। তার রসবোধ মানুষকে যেমন স করতো তেমনি রক্রোক্তি প্রতিপক্ষকে করতো লাজওয়াব। এমনি এক প্রতিবাদী কণ্ঠ চলে গেলেন। আমাদের মধ্য থেকে, সেদিন ছিল ১৮ জুন, ২০০২ সাল, মঙ্গলবার। ব্যাস হয়েছিল ৮১ বছর।(সাপ্তাহিক অনন্যা, ১-১৫ জুলাই ২০০২)'),
                ),
                SizedBox(
                  height: 50,
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                    '    অধ্যাপক নীলিমা ইব্রাহিম : এক \nঅনন্যসাধারণ অকুতোভয় বিদুষী\n'
                    '             রফিকুল ইসলাম',
                    style: TextStyle(
                        fontWeight: FontWeight.bold,
                        color: Colors.blueAccent,
                        fontSize: 18),
                  ),
                ),
                SizedBox(
                  height: 50,
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'বেগম সুফিয়া কামালের পর প্রফেসর নীলিমা ইব্রাহিম বিদায় নিলেন এই সুন্দর পৃথিবী ও তাদের প্রিয় বাংলাদেশ থেকে। নারী-পুরুষ নির্বিশেষে বাংলাদেশে ওই দুই মহীয়সী রমণীর সমকক্ষ মানুষ আবার করে সৃষ্টি হবে কে জানে? বাগেরহাটের এক সম্ভ্রান্ত জমিদার পরিবারের সন্তান নীলিমা ইব্রাহিমের স্কুলের শিক্ষাজীবন খুলনায় এবং কলেজ ও বিশ্ববিদ্যালয় বা উচ্চশিক্ষা জীবন কলকাতায় অতিবাহিত হয়। কলকাতা বিশ্ববিদ্যালয় থেকে অর্থনীতিতে স্নাতক সম্মান এবং বাংলায় স্নাতকোত্তর ডিগ্রি অর্জন চল্লিশের দশকের মাঝামাঝি সময়ের আগেই হলেও মিসেস নীলিমা ইব্রাহিমের গবেষণা ও অধ্যাপনা জীবন শুরু ঢাকা বিশ্ববিদ্যালয়ে পঞ্চাশ দশকের মাঝামাঝি সময় থেকে। পঞ্চাশের দশকের শেষ দিকে। প্রফেসর মুহম্মদ আবদুল হাইয়ের অনুপ্রেরণায় ও তত্ত্বাবধানে তিনি বাংলা বিভাগ থেকে প্রথম পিএইচ ডি ডিগ্রি লাভ ও অধ্যাপনা জীবন শুরু করেন। প্রফেসর নীলিমা ইরাহিমের হার হওয়ার সুযোগ আমার হয়নি। তবে সহকর্মী হতে পেরেছিলাম, বস্তুত ইব্রাহিম এবং আমি বাংলা বিভাগে যথাক্রমে পূর্ণ ও কালীন শিক্ষক পদে যোগদান করেছিলাম। তারপর দীর্ঘকাল বাংলা বিভাগ। এবং বিভাগের বাইরে তার সঙ্গে আমার বিচিত্র কাজ করার সুযোগ হয়েছে। সে অভিজ্ঞতা আমার জীবনের এক মূল্যবান সম্পদ।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'বিদেশ থেকে ভাষাতত্ত্ব পড়ে ষাটের দশকের গোড়ার দিকে আবার বাংলা বিভাগে সিনিয়র। লেকচারার পদে যোগাদানের থেকে কয়েক দশক তার সঙ্গে ঘনিষ্ঠভাবে মেশার সুযোগ পাই। মনে পড়ে, ১৯৬৩ সালের সেপ্টেম্বর মাসে বাংলা বিভাগ। আয়োজিত ‘ভাষা ও সাহিত্য সপ্তাহ ১৩৭০-এর কথা, যে অনুষ্ঠানমালা হাজার বছরের বাংলা ভাষা ও সাহিত্য, বাংলা লিপি, বাংলাগান তথা বাঙালি মহান ঐতিহ্য বিষয়ে এদেশের মানুষকে সচেতন করে তুলেছিলো, জাগিয়ে দিয়েছিলো তাদের: মধ্যে বিস্মৃত জাতিসত্তার চেতনা। ভাষা ও সাহিত্য সপ্তাহে প্রফেসর মুহম্মদ আবদুল হাই সাহেবের সামগ্রিক তত্ত্বাবধানে একদিকে আমরা নবান শিক্ষককুল, যেমন আনিসুজ্জামান, মনিরুজ্জামান, আবু হেনা মোস্তফা কামাল এবং আমি ছিলাম, অপরদিকে ছিলেন প্রবীণ শিক্ষকদের মধ্যে মুনীর চৌধুরী, আহমদ শরীফ, কাজী দীন মুহম্মদ প্রমুখ। বিভাগের বাইরে থেকে ভাষা ও সাহিত্য সপ্তাহে যোগ দিয়েছিলেন। সৈয়দ মর্তুজা আলী, ড. মুহম্মদ শহীদুল্লাহ, ড. মুহম্মদ এনামুল হক, মুহম্মদ মনসুর উদ্দীন, সৈয়দ আলী আহসান, অজিতকুমার গুহ শুধু আলোচনা নয়, কবিতা পাঠের আসরে মধ্যযুগীয় রীতিতে ভারতচন্দ্রের কাব্য পাঠ করে মাতিয়ে দিয়েছিলেন নীলিমা ইব্রাহিম, গদ্যপাঠের আসরেও ইসমাইল হোসেন সিরাজীর রায়নন্দিনী থেকে অনবদ্য পাঠ করেছিলেন তিনি। মুনীর চৌধুরী। দীনবন্ধু মিত্রের প্রহসন সধবার একাদশীর নিমচাদ চরিত্রের সংলাপে ছিলেন ঈর্ষণীয়, আমরা তরুণ শিক্ষকেরা প্রায় প্রতিটি পাঠ-অনুষ্ঠানেই ছিলাম। নবীন-প্রবীণ, ছাত্র-ছাত্রী শিক্ষক-শিক্ষিকাদের মিলিত সব অনুষ্ঠানে কি যে উম্মাদনার সৃষ্টি করেছিলো, তা আজকের দিনে বোঝানো যাবে না। ভাষা ও সাহিত্য সপ্তাহে নীলিমা ইব্রাহিমের সঙ্গে ঘনিষ্ঠ হওয়ার সুযোগ ঘটে যা উত্তরোত্তর বৃদ্ধি পায়। শ্রেণীকক্ষের বাইরে ছাত্র-ছাত্রী ও শিক্ষক-শিক্ষিকাদের নিবিড় মেলামেশা শিক্ষনীয় বিষয়কে কতো মনগ্রাহী করে তুলতে পারে, সেবারেই তা প্রথম বুঝতে পারি।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'সামরিকজান্ত্রাশাসিত পাকিস্তানে ষাটের দশক ঢাকা বিশ্ববিদ্যালয়ের জন্য খুবই অস্থির ছিলো। একদিকে সাংস্কৃতিক আন্দোলন যেমন রবীন্দ্র-জন্ম- শতবার্ষিকী, ভাষা ও সাহিত্য সপ্তাহ, রবীন্দ্রসঙ্গীত নিষিদ্ধকরণের বিরুদ্ধে আন্দোলন, বাংলা ভাষা বর্ণমালা সংস্কার ও পরিবর্তনের প্রতিরোধ সংগ্রাম, অপরদিকে ছাত্র সমাজের সামরিক স্বৈরাচারবিরোধী সংগ্রামের তীব্রতার উত্তরোত্তর বৃদ্ধিপ্রাপ্তি। সবটা মিলে গিয়াসউদ্দিন। একটা উত্তেজনার সময়। ষাটের দশকে বাংলা বিভাগের শিক্ষকদের মধ্যে ছাত্রসমাজের সামরিক স্বৈরাচারবিরোধী সংগ্রামে। ছাত্রনেতা ও কর্মীদের সঙ্গে লোকচক্ষুর আড়ালে সবচেয়ে ঘনিষ্ঠ ছিলেন নীলিমা ইব্রাহিম। বস্তুত সেই বিপজ্জনক সময়ে ইকবাল হল নিকটবর্তী ফুলার রোড আবাসিক এলাকার নীলিমা ইব্রাহিমের বাসাটি ছিলো ছাত্রনেতা ও কর্মীদের নির্ভয় আশ্রয়স্থল, তিনি ছিলেন তাদের জননীসদৃশ। ঊনসত্তরের গণআন্দোলনের দিনগুলোতে পাকিস্তান সামরিক জান্তার চোখে বিপজ্জনক ছাত্রনেতা ও কর্মীদের জন্য নীলিমা ইব্রাহিমের বাড়ির দরজা ছিলো দিবারাত্রি উন্মুক্ত। রণক্লান্ত ছাত্রকর্মীরা নীলিমা আপার কাছে পেতো মায়ের স্নেহ ও সেবাযত্ব। ইকবাল হল সংলগ্ন বিশ্ববিদ্যালয় আবাসে থেকে ঊনসত্তরের মহান গণঅভ্যুত্থানের দিনগুলোতে এই দৃশ্য দেখার সুযোগ আমার হয়েছিলো। বস্তুত ১৯৬৯, ৭০, ৭১ সালের দিনগুলোতে চরম উত্তেজনা ও বিপদের মধ্যে নীলিমা ইব্রাহিমকে দেখেছি অবিচলিত, দৃঢ় প্রত্যয়ী এবং আমাদের অনুপ্রেরণার উৎস। প্রসঙ্গক্রমে উল্লেখযোগ্য যে, ১৯৭১ সালে মুক্তিযুদ্ধের সময় আমরা বাংলা বিভাগের শিক্ষকরা কেউ দেশ ছাড়িনি এবং এই চরম দুঃসময়ে আমরা প্রায় সব শিক্ষকই মুক্তিযুদ্ধের পক্ষে কাজ করার চেষ্টা করেছি। পাকিস্তান বাহিনী ও তাদের দোসরদের শোন দৃষ্টি স্বাভাবিকভাবেই বাংলা বিভাগের শিক্ষকদের ওপর ছিলো। ফলে মুক্তিযুদ্ধের নয় মাসে আনোয়ার পাশা, মুনীর চৌধুরী ও মোফাজ্জল হায়দার চৌধুরীকে গাতকদের হাতে প্রাণ দিতে হয়,মনিরুজ্জামান ও সৈয়দ আকরাম হোসেনকে নয় মাস ফেরারি জীবনযাপন করতে হয়, আমাকে ক্যান্টনমেন্টে পাকিস্তান বাহিনীর বন্দি শিবিরে নিগৃহীত হতে হয় আর পাকিস্তান সামরিক কর্তৃপক্ষ বরখাস্ত করে ড মুহম্মদ এনামুল হককে, সতর্ক করে দেয় অধ্যাপক মুনীর চৌধুরী ও নীলিমা ইব্রাহিমকে। কিন্তু মুক্তিযোদ্ধাদের সাহায্য সহযোগিতা, বিশেষত আশ্রয়ের ব্যবস্থা ইত্যাকার কাজে বেগম সুফিয়া কামাল আর প্রফেসর নীলিমা ইব্রাহিম মুক্তিযুদ্ধের দিনগুলোতে যা করেছেন, তা অনেকেই জানেন না। এ কাজে তাদের প্রধান সহযোগী ছিলে আলবদর বাহিনীর হাতে নিহত ইতিহাসের অধ্যাপক প্রফেসর নীলিমা ইব্রাহিমের কলেজ বিশ্ববিদ্যালয় জীবন কেটেছে কলকাতায়, সেখানে আত্মীয় ও বন্ধুবান্ধবের কোনো অভাব ছিলো না। মুক্তিযুদ্ধের শুরুতে তিনি যখন ঢাকা ছেড়ে সপরিবারে নরসিংদীর গ্রামাঞ্চলে ছিলেন, তখন আগরতলা হয়ে কলকাতা চলে যেতে পারতেন, কিন্তু তিনি ঢাকায় ফিরে আসেন। আমরা তাকে প্রশ্ন করেছিলাম, তিনি কেনো সবাইকে নিয়ে কলকাতা চলে যাননি। তার একটাই উত্তর ছিলো, দেশ ছাড়বো কেনো? মরতে হয় দেশের মাটিতে মরবো। একাত্তরে প্রফেসর নীলিমা ইব্রাহিমের দেশ না ছাড়ার প্রধান কারণ ছিলো। দেশের মধ্যে পাকিস্তানিদের সঙ্গে জীবনপণ যুদ্ধে অংশগ্রহণ করা। নীলিমা ইব্রাহিমের মুক্তিযুদ্ধ ছিলো দেশের মধ্যে, অসহায় দেশবাসীর সঙ্গে থেকে সন্তানসম মুক্তিযোদ্ধাদের যতোটা সম্ভব সেবা ও অনুপ্রাণিত করা। অবশ্য এই ঝুঁকিপূর্ণ কাজে তাকে একাধিকবার অচিন্তনীয় বিপদের মুখে পড়তে হয়েছে। কিন্তু তিনি থেমে যাননি।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'বাংলাদেশের স্বাধীনতার পরপর আমরা যারা দৈবক্রমে বেঁচে যাই, তাদের প্রথম ও প্রধান কাজ হয়ে দাড়ায় ১৯৭১ সালের ১০ থেকে ১৪ ডিসেম্বরের মধ্যে পকিস্তানের দালাল বুদ্ধিজীবীদের প্রদত্ত তালিকা অনুযায়ী রাজাকার ও আলবদর বাহিনী কর্তৃক ধরে নিয়ে যাওয়া বুদ্ধিজীবীদের অনুসন্ধান। বাংলা বিভাগের মুনীর চৌধুরী, মোফাজ্জ হায়দার চৌধুরী, আনোয়ার পাশা নিখোজ। তারা জীবিত না মৃত, তখনো আমরা জানি না । বিশ্ববিদ্যালয়ের আরো অনেক শিক্ষকের কোনো খোঁজ নেই। নীলিমা আপার নেতৃত্বে আমরা অবিলম্বে কাঁপিয়ে পড়ি। নিখোঁজ। বুদ্ধিজীবীদের সন্ধানে, রায়েরবাজার বধ্যভূমিতে প্রাপ্ত বুদ্ধিজীবীদের লাশ এমন বিকৃত হয়ে গিয়েছিলো যে আমরা অনেকের। লাশ শনাক্ত করতে পারিনি। যাদের লাশ শনাক করা গিয়েছিলো, তাদের লাশ নিকট আত্মীয়- পরিজনরা নিয়ে गान, কিন্তু আমরা আমাদের বিভাগের মুনীর চৌধুরী ও মোফাজ্জল হায়দার চৌধুরীর লাশ সনাক্ত করতে পারিনি। এছাড়াও অনেক শিক্ষকের কোনো সন্ধান নেই। নীলিমা আপার নেতৃত্বে আমরা একাত্তরের মুক্তিযুদ্ধে পাকিস্তান বাহিনী কর্তৃক ংস হওয়া পুলিশ বাহিনীর এক ডিএসপিকে খুঁজে বের করি। তার সাহায্যে আমরা ইপিআরটিসি’র যে বাসে করে সব বাড়ি থেকে চোখ বেঁধে শিক্ষকদের তুলে নিয়ে যাওয়া হয়েছিলো, সে- বাসটি খুঁজে বের করি। ইপিআরটিসি অফিস থেকে ওই বাসের ড্রাইভারের টাঙ্গাইলের গ্রামের নাম ঠিকানা সংগ্রহ করে এবং এই ডিএসপির সাহাযো তাকে গ্রামের বাড়ি থেকে ধরে আনা হয়। সে আমাদের নিয়ে যায় মিরপুর গোরস্থান সংলগ্ন ধানক্ষেতে, যেখানে আনোয়ার পাশা, ইংরেজির রাশিদুল হাসান, ইতিহাসের সন্তোষ ভট ডাম, আবুল খায়ের, গিয়াসউদ্দিন, মেডিকেল অফিসার তা মর্তুজা প্রমুখকে গুলি করে মেরে গত করে গণকবর দেয়া হয়েছিলো। সেখান থেকে ওই শহীদ শিক্ষকদের লাশ ঢাকা মেডিকেল কলেজ হাসপাতাল মর্গে এনে শনাক্তকরণের পর আমরা বিশ্ববিদ্যালয় মসজিদ প্রাঙ্গণে জানাজা এবং দাফন করি। এই জানাজায় মুজিবনগর থেকে সদ্য ঢাকায় আগত প্রধানমন্ত্রী তাজউদ্দিন আহমদও যোগ দেন। যুদ্ধের চরম পর্যায়ে স্বাধীন বাংলা বেতার কেন্দ্র থেকে বারবার সর্তক করা সত্ত্বেও বুদ্ধিজীবীরা ঢাকা ছেড়ে না যাওয়ায় তিনি দুঃখ ও ক্ষোভ প্রকাশ করেন। পরে নীলিমা আপার নেতৃত্বে আমরা বঙ্গবন্ধুর কাছে গিয়ে মিরপুরে শ‍হীদ বুদ্ধিজীবী স্মৃতিসৌধ নির্মাণের ব্যবস্থা এবং ১৯৭২ সালের ১৪ ডিসেম্বর থেকে বাংলা বিভাগের উদ্যোগে শহীদ বুদ্ধিজীবী দিবস পালন ও প্ৰচলন করি। টিএসসিতে প্রথম শহীদ। বুদ্ধিজীবী দিবসের অনুষ্ঠানে রাষ্ট্রপতি আবু সাঈদ চৌধুরী প্রধান- অতিথি ছিলেন, সভাপতিত্ব করেন উপাচার্য প্রফেনর মোজাফফর আহমদ চৌধুরী, চিকিৎসকদের পক্ষে ঢাকা মেডিকেল কলেজের প্রফেসর বদরুদ্দোজা চৌধুরী, প্রকৌশলীদের তরফ থেকে প্রকৌশল বিশ্ববিদ্যালয়ের জহুরুল হক আর সাংবাদিকদের থেকে এহতেশাম হায়দার চৌধুরী প্রমুখ আলোচকদের মধ্যে ছিলেন। বন্ধুর স্বাধীনতার পর বাংলা বিভাগের প্রধান হিসেবে প্রফেসর নীলিমা ইব্রাহিম। শুধু বিধস্ত। বাংলা বিভাগকেই পুনরুজ্জীবিত করেননি, সঙ্গে সঙ্গে রোকেয়া হলের প্রভোস্ট ও বাংলা একাডেমীর মহাপরিচালকের দায়িত্ব অত্যন্ত দক্ষতার সঙ্গে পালন করেছেন। আরো দুটি অত্যন্ত স্পর্শকাতর বিষয়ে বঙ্গবন্ধু কর্তৃক দায়িত্বপ্রাপ্ত হয়ে তিনি অত্যন্ত নিপুণতার সঙ্গে সম্পন্ন করেন। যে দুটি স্পর্শকাতর বিষয়ে বঙ্গবন্ধু প্রফেসর নীলিমা ইব্রাহিমকে দায়িত্ব দিয়েছিলেন তার একটি ছিলো, একাত্তরের মুক্তিযুদ্ধে পাকিস্তানি সৈন্য এবং তাদের দালान আলবদর, আলশামস, শান্তি কমিটির নরপশু ও পিশাচদের দ্বারা অপহৃত লাঞ্ছিত নির্যাতিত হতভাগা অসংখ্য বাঙালি মা-বোন এবং ওয়ার বেবিদেরা পুর্নবাসনের জটিল বিষয়টি। স্বাধীনতার বাংলাদেশ সরকারের জন্যে এটা ছিলো একটা কঠিন সমস্যা। প্রফেসর নীলিমা ইব্রাহিম একাত্তরের হতভাগা মা-বোনদের পুনর্বাসন এবং ওয়ারবেবিদের বিদেশীগণ কর্তৃক এ্যাডাপ্ট করার সমস্যা নিয়ে দিনের পর দিন নীরবে যে কি অক্লান্ত পরিশ্রম করেছেন, তখন যারা তাকে দেখেননি তারা তা কল্পনাও করতে পারবেন না। এই সমস্যা মোকাবেলায় প্রফেসর নীলিমা ই যার সঙ্গে কাজ করেন তিনি হলেন বিচারপতি কে. এম সোবহান। একাত্তরে নির্যাতিত মা-বোনদের অবমাননার কিছু কিছু কাহিনী তিনি লিখে গেছেন, যার কয়েকটি টেলিভিশন অনুষ্ঠানে প্রচারিত হয়েছে। একটি রক্ষণশীল সমাজে চরম দুর্ভাগ্যের শিকার অগণিত মা-বোনের জীবনে একটু শান্তি ও স্বস্তি আনয়ন প্রয়াসে মিসেস নীলিমা ইব্রাহিমের একাগ্রতা ৩ আকুলতা তার চরিত্রের দৃঢ়তা ও মিশ্ররূপের অপরূপ পরিচয় প্রকাশ করে।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'বঙ্গবন্ধু প্রফেসর নীলিমা ইব্রাহিমকে দিয়ে আর একটি স্পর্শকাতর বিষয়ের সুরাহা করান, বিষয়টি ছিলো ১৯৭১ সালে মুক্তিযুদ্ধের সময় যেসব বুদ্ধিজীবী যা শিল্পী বেতার ও টেলিভিশনে পাকিস্তানের দালালি এবং মুক্তিযুদ্ধের বিরোধিতা বা সমালোচনা করেছে, সেসব সাংস্কৃতিক রাজাকারদের বিষয়ে সিদ্ধান্ত গ্রহণ। এ বিষয়ে তাকে সহায়তা করেন ঢাকা বিশ্ববিদ্যালয়ের ইংরেজী বিভাগের অধ্যাপক আহসানুল হক এবং প্রবীণ সাংবাদিক এবিএম মুসা। কমিটির সুপারিশ অনুযায়ী স্বাধীন বাংলাদেশে প্রচার মাধ্যমে একাত্তরের দালাল বুদ্ধিজীবী ও কলাকুশলীদের অনুষ্ঠান প্রচার বন্ধ থাকে। পরে অবশ্য স্বাধীন বাংলা বেতার কেন্দ্রের অন্যতম বিশিষ্ট শিল্পী এম এ জব্বার একটি লাইভ টেলিভিশন অনুষ্ঠানে সঙ্গীত পরিবেশনার পর বঙ্গবন্ধুর কাছে ওইসব দালাল শিল্পী কলাকুশলীদের ক্ষমা করে দেয়ার জন্য আকুল আবেদন জানালে বঙ্গবন্ধু ওই দালাল শিল্পীদের ক্ষমা করে দেন। তবে ১৯৭১ সালে বেতার ও টেলিভিশনে পাকিস্তানের দালালদের সম্পর্কে নীলিমা ইব্রাহিম কমিটির রিপোর্টটি একটি ঐতিহাসিক দলিল। একাত্তরে সাংস্কৃতিক রাজাকারদের পরিচয় ওই রিপোর্টে রয়েছে।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'প্রফেসর নীলিমা ইব্রাহিম তার জীবনে বহু সংস্থা ও প্রতিষ্ঠানের সঙ্গে জড়িত ছিলেন, যার মধ্যে সবচেয়ে গভীরভাবে সবচেয়ে দীর্ঘ সময় সম্পৃক্ত'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'নীলিমা ইব্রাহিম সারহাও ছিলেন বাংলাদেশের মহিলা সমিতির সঙ্গে। তার কর্মময় জীবনে শত ব্যস্ততার মধ্যেও মহিলা সমিতি ছিলো তার হৃদয়ের সবচেয়ে কাছের প্রতিষ্ঠান, প্রায়। আপন সন্তানের মতো, সর্বকনিষ্ঠ সন্তান। এদেশের নারীমুক্তির জন্য এই মহিলা সমিতির মাধ্যমে তিনি দেশে-বিদেশে দীর্ঘকাল সংগ্রাম করে এসেছেন। ঢাকা বিশ্ববিদ্যালয় জীবনে ঢাকা ইউনিভার্সিটি উইমেন্স হল-এর রোকেয়া হল নামকরণ, রোকেয়া রচনাবলী বাংলা বিভাগের পাঠ্য তালিকাভুক্ত করার তার যে ভূমিকা ছিলো, তা পূর্ণাঙ্গ হয় মহিলা সমিতির মাধ্যমে বাংলাদেশের নারী জাগরণে তার ভূমিকায়। তিনিও বেগম সুফিয়া কামালের মতো বেগম রোকেয়ার আদর্শে অনুপ্রাণিত ও নিবেদিতপ্রাণ ছিলেন, জীবনের শেষ পর্যন্ত নারী-মুক্তি ছিলো প্রফেসর নীলিমা ইব্রাহিমের সকল কর্মকান্ডের মূলমন্ত্র। এদেশের হতভাগা, নির্যাতিত, নিগৃহীত, নিপীড়িত নারীদের জাগরণে প্রফেসর নীলিমা ইব্রাহিমের ভূমিকা ছিলো যেমন বলিষ্ঠ, তেমনই অকুতোভয়। আসলে প্রফেসর নীলিমা ইব্রাহিম ছিলেন এক মহান মানবতাবাদী সমাজকর্মী, শিক্ষা, সাহিত্য, সংস্কৃতি, সমাজ নিয়ে তার ধ্যান-ধারণা ছিলো এক উদার মুক্ত সুসংস্কৃত বাংলাদেশ, আজীবন তিনি সে-জনা সংগ্রাম করে গেছেন। তার প্রতি আমাদের অকুণ্ঠ শ্রদ্ধা।'),
                ),
                SizedBox(
                  height: 50,
                ),
                Text(
                  '      স্মরণ\n'
                  'আনিসুজ্জামান',
                  style: TextStyle(
                      fontWeight: FontWeight.bold,
                      color: Colors.blueAccent,
                      fontSize: 18),
                ),
                SizedBox(
                  height: 50,
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'নীলিমা ইব্রাহিম খুলনার মেয়ে। সুতরাং ম্যাট্রিক পাশ করে তিনি যে লেখাপড়া করতে গিয়েছিলেন কলকাতায় তা ছিল খুবই স্বাবাবিক। যেটা আশ্চর্যের মনে হয় এই যে, তিনি বি এ পাশ করেছিলেন অর্থনীতিতে অনার্স নিয়ে, তবে তার বছর দুই পথে এম এ-তে ভর্তি হয়েছিলেন আধুনিক ভারতীয় ভাষা বিভাগে কলকাতা বিশ্ববিদ্যালয়ে। সেখানে তখনো বাংলা বিভাগ খোলা হয়নি আान করে এই ভারতীয় ভাষার পাঠক্রমেই বিশেষ বিশেষ ছিল বাংলায়। বিভাগের প্রধান ছিলেন বৈষ্ণব সাহিত্যবিশারদ ম্যাতনামা কীর্তিনীয়া খগেন্দ্রনাথ নি। ১৯৪০ সালে এম এ পাশ করার কিছুকাল পরে তিনি বাংলা নাটক সম্পর্কে গবেষণা শুরু করেন। হেমেন্দ্রনাথ দাশগুপ্তের অধীনে। হেমেন্দ্রনাথ ছিলেন বিখ্যাত আইনজীবী, কিছু নাটকে তাঁর আসক্তি ছিল প্রবল। তিনি নাটক পরিচালনা করেছেন, মঞ্চে অভিনয় করেছেন এবং নাটক সম্পর্কে অতি মুল্যবান বইপত্র লিখেছিলেন। এসব কারণে তিনি কলকাতা বিশ্ববিদ্যালয়ের প্রথম গিরিশ- অধ্যাপকের পদে নিয়োগলাভ করেন। এমন মানুষের তত্ত্বাবধানে কাজ করতে পারা গৌরবের কথা। কিন্তু যুদ্ধ, বিবাহ এ দেশবিভাগ তাঁর কাজে বাধা সৃষ্টি হতাম। করেছিল। স্বামী রেডিওলজিস্ট ক্যাপ্টেন (ডা) মুহম্মদ ইব্রাহিমের সঙ্গে একসময়ে চলে আসেন বরিশালে সেখান থেকে ঢাকায়। ঢাকায় এসে গবেষণার ছিন্ন সুত্রটি আবার কুড়িয়ে নেন এবং ঢাকা বিশ্ববিদ্যালয় বাংলা বিভাগের অধ্যক্ষ মুহম্মদ আবদুল হাইয়ের তত্ত্বাবধানে উনিশ শতকের বাংলা নাটক সম্পর্কে পিএইচডি পর্যায়ে কাজ শুরু করেন। তিনিই ছিলেন হাই সাহেবের প্রথম গবেষনা-ছাত্রী।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'আমরা তখন অন্য পরীক্ষা দিয়েছি। বিষাণে শিক্ষকের প্রয়োজন ছিলো। উঠতে না উঠতেই নীলিমা আপা বিভাগে লেকচারার হয়ে যোগ দিলেন। তখন এম এ কাসে তিনি পড়াতেন না, তাই তার ছাত্র হওয়ার সুযোগ তবে তাঁর সঙ্গে সম্পর্কটা হওয়া উচিত ছিল শিক্ষ ও ছাত্রের কিছু হয়ে গেল ভাইবোনের। বিভাগে পরিচয় হতে বিলম্ব হয়নি, তারপর আমার সুরে মুক্তিযুদ্ধের শহীদ ইতিহাস বিভাগের গিয়াসউদ্দিন আহমদ আর আমার বাল্যবন্ধু পরে জাতিসং সমিতির মহাসচিব আহমদ হোসেনের যোগাযোগ। আমাদের জন্যে তাঁর বাড়ির পুরার অবারিত হয়ে গেল। সময় পেলে সেখানে গিয়ে কবি আড্ডা দিচ্ছি, চলছে খাওয়া-দাওয়া। নীলিমা আপা বই লিখছেন ‘শরৎ-প্রতিভা’, ‘বাংলার মধুসুদন’, আমি তার আদ্যন্ত প্রুফ দেখছি। ততদিনে আমিও যোগ দিয়েছি বিভাগে— আড্ডার ক্ষেত্র প্রসারিত হয়েছে কলাভবনের জুনিয়র কমনরুমে এবং আরো একটি জায়গায়। জগন্নাথ কলেজের বাংলার অধ্যাপক—আমার শিক্ষক অজিতকুমার গুহ প্রায় আসতেন নীলিমা আপার বাসায়, ভোজনরসিক ও রন্ধনপটু অজিতবাবুর বাড়িতেও আমরা জড়ো আমরা নীলিমা আপার পাঁচ মেয়ের তারা আমাদের সঙ্গে পরিহাস করে, যেমন পরিহাস করে বাপ-মার সঙ্গে। আমাদের বাড়িতেও আপা ও ডাক্তার সাহেবের যথেষ্ট যাতায়াত ছিল। নীলিমা আপাকে আশা কন্যাসম জ্ঞান করতেন, তিনিও আব্বা-মাকে যথেষ্ট সম্মান করতেন। একটা কালো স্কোভা গাড়ি কিনেছিলেন নীলিমা আপা। তার কিছুদিন পরেই আমার বিয়ে। ঠিক হলো, ওই গাড়ি করেই বর যাবে বিয়েবাড়িতে। গাড়ির রং কালো বলে কেউ কেউ খুঁতখুঁত করছিলেন। আমার তো এসব বিষয়ে কোনোই সংস্কার ছিল না। দেখলাম, আব্বাও এই প্রস্তাব অনুমোদন করছেন। তাঁর নিজের যে অস্টিন গাড়ি ছিল, সেটা ততদিনে পুরোনো ও ধূলিমলিন হয়ে গেছে। তাতে আব্বা ও মা গেলেন, আমি গেলাম। নীলিমা আপার গাড়িতে, তিনি ও ডাক্তার সাহেব। গেলেন অন্য কারো বাহনে।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'নীলিমা আপার পিএইচ ডি ডিগ্রিলাভে আমরা সকলেই খুব উল্লসিত হয়েছিলাম। টাইপরাইটারের সুবিধা কেন যেন তিনি পাননি। চারগ্রন্থ অভিসন্দর্ভ তিনি নিজের হাতে লিখেই জমা দিয়েছিলেন। সংসার করে, পূর্ণকাল শিক্ষকতা করে, তারপর গবেষণার কাজ, তার ওপরেও এই কায়িক শ্রম এর মূলা তিনি পেয়েছিলেন। আমাদের উল্লাসের অনুপাতেই মানাপিনা হলো— সে এক এলাহি কারবার। নীলিমা ইব্রাহিমই ঢাকা বিশ্ববিদ্যালয় থেকে প্রথম বাংলা- বিষয়ে পিএইচ ডি ডিগ্রি অর্জন করেন। তারপরেই ওই একই ডিগ্রি পেলেন আশুতোষ ভট্টাচার্য ঢাকা বিশ্ববিদ্যালয়ে তিনি মুহম্মদ আবদুল হাইয়ের শিক্ষক ছিলেন এককালে, ডিগ্রিলাভের সময়ে কলকাতা বিশ্ববিদ্যালয় বাংলা বিভাগের লেকচারার। সমাবর্তন- উৎসবে যতোদূর মনে করতে পারি, ১৯৬২ সালে— তিনিও এলেন কলকাতা থেকে। তিনি শু নীলিমা আপা একসঙ্গে ডিগ্রি নিলেন। ততদিনে আমারও ডিগ্রি হয়ে গেছে। আশুতোষ বাবু ও নীলিমা আপা আর তাদের মাঝখানে দাড়িয়ে আমি কনভোকেশনের শোষিত হয়ে ছবি। তুললাম।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'এরপর নীলিমা আপার খ্যাতি ছড়িয়ে পড়লো চারদিকে প্রদেশের নানা স্থান থেকে তো বটেই, পশ্চিম পাকিস্তান থেকেও সভাসমিতিতে তাঁর ডাক আসতে লাগলো। তিনি বাহু হয়ে গেলেন। ডাক্তার সাহেব একরকম অবসর নিলেন বলে নাকি হল রোডের বাড়ি ছেড়ে চলে এলেন ঢাকা বিশ্ববিদ্যালয়ের ফুলার রোড এলাকার আবাসে। আমিও এলাম তার পাশের পাড়ায় নীলক্ষেত রোড এলাকায়। তবে আগের মতো আর যাওয়া হয় না। দেখা-সাক্ষাৎ প্রধানত হয় বিভাগেই—সংকটের সময়েই যাওয়া হয় রবীন্দ্রসংগীত-সম্পর্কিত বিতর্কে কী বানানসার বিষয়ে দেবেগে আমরা একই দাড়াই, বিশ্ববিদ্যালয়ের শিক্ষক সমিতিতে ভোট নিই একই সঙ্গে। তফাৎটা এই যে, তখনকার ভাইস-চান্সেলর ডক্টর মুহম্মদ ওসমান গনির সঙ্গে তাঁর সম্পর্ক যতো ভালো, বিশ্ববিদ্যালয়ের প্রধানের সঙ্গে আমাদের অতটা নয়।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'একবার বেশ মজা হয়েছিল। কাজী দীন মুহম্মদ বাংলা একাডেমীর পরিচালক হয়ে চলে যাওয়ায় তাঁর বিভাবের পদটি অস্থায়ীভাবে খালি হলো, বিজ্ঞাপিতও হলো! প্রার্থী চারজন মোফাজ্জল হায়দার চৌধুরী, আহমদ শরীফ, নীলিমা ইব্রাহিম ও আমি। ভাইস- চ্যান্সেলরের বাড়ির কার্যালয়ে সাক্ষাৎকার নেওয়ার ব্যবস্থা। আমি পৌঁছে দেখি, প্রার্থীরা যে-মারে বলে; সেখানকার বাতাস একটু ভারি। পরিবেশটা লঘু করার জনো বললাম যদি শিক্ষাগত যোগ্যতা দেখে নির্বাচন করে, তবে পদটি পাবেন মোফাজ্জল হায়দার চৌধুরী, যদি প্রকাশনার মানদণ্ডে বিচার করে, তবে তা হবে আহমদ শরীফের প্রাপ্য, যদি পিএইচ ডি দেখে নেয়, তাহলে নীলিমা আপাই বাছাই হবেন (আমারও পিএইচ ডি অবশ্য তখন হয়ে গেছে), আর যদি এঁদের মধ্যে কাকে নেবেন, নির্বাচকমণ্ডলী তা স্থির করতে না পারেন, তাহলে আমিই সেটা পাবো। আমার কথায় সবাই হেসেছিলেন, তবে পনটা পেয়েছিলেন নীলিমা আপাই। পরে কাজী দীন মুহম্মদ বিভাগে ফিরে আসায় অবশ্য আপাকে পদটি ছেড়ে দিতে হয়।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'পিএইচ ডি ডিগ্রিলাভের পরে নীলিমা আপা যাঁকেছিলেন সৃজনশীল সাহিত্যসৃষ্টিতে— নাটক, উপন্যাস, রম্যরচনায়। তাঁর নাটক অভিনীত এবং উপন্যাস সমাদৃত হয়েছিল। তারই একটি নাটকে তাঁর মধ্যম কন্যা ডলির অভিনয় নৈপুণ্য খুবই প্রশংসিত হয়েছিল।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      '১৯৬৯ সালে আমি চট্টগ্রাম বিশ্ববিদ্যালয়ে রিডার হয়ে চলে গেলাম। আমি যেদিন চলে যাই, সেদিনই দুর্ঘটনায় মৃত্যু হয় অধ্যাপক মুহম্মদ আবদুল হাইয়ের। পরের বছরে মোফাজ্জল হায়দার চৌ আহমদ শরীফ ও নীলিমা ইব্রাহিম রিডারের স্থায়ী পদ লাভ করেন। বাংলাদেশের স্বাধীনতা লাভের প্রাক্কালে বিভাগের প্রধান অধ্যাপক মুনীর চৌধুরী ও মোফাজ্জল চৌধুরী এবং নীলিমা আপার অনুজপ্রতিম গিয়াসউদ্দিন আহমদ আল-বদরের ঘাতকের হাতে শহীদ হন। স্বাধীন দেশে ডাকা বিশ্ববিদ্যালয় যখন খুললো তখন নীলিমা আপা হলেন বিভাগের অধ্যক্ষ। কয়েকদিনের মধ্যে অধ্যাপক সৈয়দ আলী আহসান জাহাঙ্গীরনগর বিশ্ববিদ্যালয়ের উপাচার্য নিযুক্ত হওয়ায় চট্টগ্রাম বিশ্ববিদ্যালয়ে বাংলা বিভাগের অধ্যক্ষ হলাম আমি।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'নটেগাছটি এখানেই মুড়োলো। নীলিমা আপা আমি কখনো আর আগের জায়গায় ফিরে যেতে পারিনি।'),
                ),
                SizedBox(
                  height: 50,
                ),
                Text(
                  'জননী নীলিমা ইব্রাহিম\n'
                  'মমতাজউদদীন আহমদ',
                  style: TextStyle(
                      fontWeight: FontWeight.bold,
                      color: Colors.blueAccent,
                      fontSize: 18),
                ),
                SizedBox(
                  height: 50,
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'সেই কবে থেকে আমরা তাঁর দেহের ছায়ায় আছি। যখনই কাছে পেয়েছেন, মধুময় হাসি হেসে বলতেন, কেমন আছ মমতাজ। কেবল আমি নই। আমাদের সংগের কায়কোবাদ, আশফাক, ব্লু র জাহাঙ্গীর সবার জন্য তাঁর অবারিত স্নেহ। মাঝে মধ্যে এমন চমৎকার চমৎকার রসিকতা করতেন। শুনে আমাদের মন ভরে যেত। সে-সব রসিকতা বা কথার পিঠে কথায় পুরাণ, বর্তমান, সাহিত্য-সংস্কৃতির প্রসঙ্গ এসে যেত। আমাদের খুব ভাল লাগত। তিনি আমাদের আপা ছিলেন। সে কেবল আনুষ্ঠানিকতার জন্য আপা বলা নয়। মন থেকে আপা জেগে উঠত।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'তিনি থাকতেন নর্থ-বুক হলের দোতলাতে। আমরা যেতাম। গিয়ে দেখি, আরো ছাত্র-ছাত্রী আছে। সবার সামনে কিছু না কিছু খাবার। আমরা গেলাম, আমাদের জন্যও খাবার এল। বার বার তাগাদা দেন, কইরে তোমরা মুখে তুলে নাও। বেশি কিছু তো নয়, একটা করে গুড়ের সন্দেশ।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'সদেশ খাইয়ে খাইয়ে তিনি উপার্জনের সব টাকা শেষ করে দিতেন। তাঁর ছাত্র-ছাত্রীর জন্য স্নেহ উজাড় করে দেয়ার মধ্যে কি জানি কত আনন্দ।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'আমার ভীষণ জ্বর। মাথা তুলতে পারিনে। পুদি পরেই আর একটা পেপারের পরীক্ষা। সেটা আমার ফাইনাল পরীক্ষা। এবার ছেড়ে দিয়ে সামনের বছর পরীক্ষা নেব, তেমন অর্থনৈতিক যোগ্যতা আমার জননী নীলিমা ইব্রাহিম মমতাজউদদীন আহমদ ছিল না। রুমমেট কায়কোবাদ দেখভাল করছেন। আমার চেয়ে তার ভাবনা বেশি। যেন সব কায়কোবাদের। সন্ধ্যার একটু আগে ছুটে এসে বললেন, আপনার অসুখের খবর পেয়ে নীলিমা আপা ওষুধ। পাঠিয়েছেন। আপার ওষুধ নিয়মিত খেলাম। অসুখের ভীষণ ব্যাপারটা কমে গেল। পরীক্ষা দিতে যাচ্ছি, শুয়ে শুয়ে পরীক্ষা দিতে হবে, তার ব্যবস্থাও হয়েছে। পরীক্ষার হলে আপা উপস্থিত আছেন। এখনো তাঁর হাতে ওষুধ। হেসে বললেন, এত একজনে অসুখ বাধাবে আর আমাকে ওষুধ নিয়ে ছুটতে হবে—এত কষ্ট দাও কেন তোমরা। আমার মাথায় হাত বুলিয়ে বললেন, কা পেতেই তো আমার আনন্দ। যেটুকু পারবে লিখবে। একটানা লিখোনা। থেমে থেমে লিখে যেও। ভাল হবে তোমার পরীক্ষা। আপার কথা শুনে আমার দুচোখে দুঃখ এল। আমার মায়ের কথা মনে পড়ে লাল। আমার চার বছর আগেই চলে গেছে। মা আমাকে এমনি ভাবে মাথায় হাত বুলিয়ে দিয়েছে। আমার দুর্বল শরীর মজবুত হল। বন্ধুর হাত ধরে কার্জন হলের দোতলায় কাঠের একটা বড় আলমারিতে পেতে রাখা শয্যায় শুয়ে পড়লাম। অঝোরে আমার দুচোখ ঝরতে লাগল। যতখানি ভাল চেয়েছিলাম ততখানি ভাল ফল হল না। তবে আরো তো খারাপ হতে পারতো।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'যাচ্ছি টুঙ্গিপাড়া। বঙ্গবন্ধুর জীবন বিজড়িত মাটিতে আমাদের যাত্রা। আজকের কাগজ আয়োজন করেছে। চলেছেন শওকত ওসমান আর ড নীলিমা ইব্রাহিম। আর আমরা দলবল ভারি করছি। সারাপথ শওকত ওসমান ও নীলিমা ইব্রাহিমের খুনসুটি দেখছি। মজাও হচ্ছে। দুজনেই বয়সের আয়োজনে সমৃদ্ধ। কিন্তু মন সুজনের তারুণ্যে ও প্রগলভতায় উচ্ছল । এক সময় শওকত ওসমান তাঁর কারোর পেয়ালা নিয়ে টীমারের বিশ্রাম কক্ষ থেকে বাইরে গেলেন। সাথে সাথে নীলিমা আপা আমাকে ইশারা দিয়ে বললেন, দেখতো মমতাজ, পাগলটা আধাকাপ চা নিয়ে কোথায় যায়। আমি ছুটে গেলাম। দেখি কি শওকত স্যার তাঁর অনির্বচনীয় ‘সামানকে আধকাপ রা যাওয়াচ্ছেন আর হাতে তার জন্য বিস্কিট ধরে রেখেছেন।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'নীলিমা আপা কক্ষ ছেড়ে বাইরে এসে হেসে। হেসে বললেন, শওকত বুড়ো সারাজীবন পাপ করে। এখন আধাকাপ চা বিলিয়ে বেহেস্তে যাবার আয়োজন। করছে। শওকত স্যার লজ্জা পেয়ে বললেন, এ বেহেস্ত আমার জন্য জায়গা খালি নেই। তোমার মতো পুণাবতীর ভারে ওটার এখন টলমল অবস্থা।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'তাদের রসময় “চাপাই-উতরাণ! শুনে আমাদের মধ্যে হাসির রোল উঠল। অমন পরিণত বয়সে তাঁরা কেন যে এতদূর কষ্টের পথ ঠেলে টুঙ্গিপাড়া এলেন— আমরা বেশ অস্বস্তিবোধ করছিলাম। কিন্তু আমাদের উদ্বিগ্ন হওয়াকে তুড়ি মেরে তাঁরা সারা পথ প্রতি মুহূর্ত উপভোগ করছেন। নীলিমা আপার এতখানি দোর, সে কেবল তাঁর মনের জোরের জন্য। একবার প্রসঙ্গ এল। বললাম, আপা আপনি স্বধর্ম ছেড়ে একজন অন্য ধর্মের মানুষকে জীবনের সঙ্গী করে নিলেন, তাতে আপনার মনে সংকোচ ও দ্বিধা- কি জেগে ওঠে।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'আপা দ্রুত উত্তর দিলেন, না কক্ষনো না। আমি তো আমার ধর্ম-ত্যাগ করিনি। আমার ধর্ম মানবধর্ম। সেই ধর্মটাকে ধরেছি, অথবা পেয়েছি বলেই, আমার সমস্ত তার লঘু হয়ে উঠেছে। আমি চোখ খুলে যা দেখি, চোখ বুজেও তা দেখি। শ্রীকৃষ্ণের বাধা আর নজিবর রহমানের আনোয়ারার মধ্যে আমি ভেদ দেখিনা। দুই নারী জীবন বিকাশের জন্য লড়ছে। এ পড়ে যাওয়াটা আমার কাছে প্রধান। তাতেই আমি নারীকে দেখি।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'আর এমন ছিল বলেই, নীলিমা আপা একাত্তরের বীরাঙ্গনা নারীদের নিয়ে তার স্নেহ ভালবাসা ও আত্মীয়তা ঘোষণা করলেন। ধীরাজনা নিয়ে তাঁর এ কাজটি কোনো একাডেমিক শৃঙ্খ মধ্যে নিয়ন্ত্রিত হয়নি। এ কাজের সংগে তাঁর বিশ্বাস ও হৃদয় যুক্ত হয়ে আছে।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'আমার সাত ঘাটের কানাকাটি দেখে আপার সে কি অবারিত উচ্ছাস। লিখে নিলেন—'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      '‘যে এক বুক আশা নিয়ে মানবাধিকারের দাবিতে ৭১-এ বাঙালিরা রক্ত দিয়েছিল, তা আজ হতাশায় নিমজ্জিত প্রায় সাত ঘাটের কানাকারি আমাদের পূর্ব জীবনের পথে এগিয়ে যাবার প্রেরণা যুগিয়েছে। মমতাজউদদীন আহমদ ও থিয়েটার কর্মীদের আলোর দিশারী জ্বলন্ত মশালে পরিণত হোক—জীবন সায়াহ্নে। এই আমার কামনা,বিশ্বাস ১০-০৩-১৯৯০’'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'তাঁর আশীবাদ পেয়ে ধন্য হলাম আমি। পাে হাত দিয়ে সালাম করে তাকে মা বলে ডাকলাম। দেখলাম, তার দুচোখও ভিজে গিয়ে। আমাকে আর আমার স্ত্রীকে তিনি বিশেষ করে একদিন তার বাসায় ডাক দিলেন। গিয়ে দেখি আয়োজন। তিনি আমাদের আপ্যায়িত করবেন। ডাক্তার ইব্রাহিমও মৃদু মৃদু হাসছেন। আমি তো হতবাক। নীলিমা ইব্রাহিম বললেন, আমার ছেলে জীবন বাজী রেখে নাটক লিখবে আর আমি বুঝি তাকে ডেকে আমার সামনে বসিয়ে যাওয়ার না। আমার স্ত্রী বলল, সব ভালবাসা ওকেই যদি দিলেন, তাহলে আমার কপালে কী? তিনি মুহূর্তে বললেন, তবে মেয়ে তোকে যে আমার আস্ত ছেলেটাই দিয়ে দিয়েছি, তাতেও তোর ক্ষিধে মিটেনা রাক্ষুসী! তখন বুঝলাম, এমন মাকে আর অন্য কখনো ভাবা যাবে না। উনিশ’শ ছাপান্ন থেকে দুহাজার দুই প্রায় পঞ্চাশ বছর আমরা তাঁর পরিমণ্ডলে আছি। ক্লাশে পড়াতেন কখনো সাহিত্যের ইতিহাস কখনো মধুসূদনের নাটক, কখনো শ্রীকৃষ্ণকীর্তন। এক ধরনের সারলা তাঁর কথা আধিকারে ছিল। জটিল বিষয় সহজ হয়ে উঠতো তাঁর পড়ানোতে। স্বাধীনতার পরপরই তিনি গেলেন চট্টগ্রাম। আমি: তখন চট্টগ্রাম কলেজের শিক্ষক। ছুটে গেলাম। তার কাছে। সংগে আমার সহযোগী এবং ছাত্র-ছাত্রী। তাকে পায়ে হাত দিয়ে সালাম করলাম। তিনি পরপর বলতে লাগলেন, আহারে পায়ে হাত দিয়ে সালাম করতে হবেনা, এমনিতেই আমি আছি তোমাদের নিয়ে। আমি বললাম, আপা, বাধা দিবেন না। আমি শিক্ষককে সালাম করছি, তাই দেখে আমার ছাত্ররাও আমাকে সালাম করবে।'),
                ),
                Padding(
                  padding: EdgeInsets.all(50.0),
                  child: Text(
                      'তিনি মজা পেয়ে বললেন, ও হ্যাঁ তাইতো, তাহলে আর একবার নতমুখ হও। ওরে আমার মমতাজের ছাত্র-ছাত্রী, দেখ দেখ, তাই দেখে তোমরাও শিখে নাও। আমাদের মধ্যে আনন্দের ঢেউ খেলে সেদিন যেমন, তেমনি সবদিন, আপাকে দেখা মানেই, পরমাত্মীয়কে পাওয়া। একবার মহিলা সমিতির অনুষ্ঠানে। আমি তাকে অভ্যাস বশে আপা বলে সম্বোধন করলাম। তিনি গম্ভীর হয়ে বললেন, আমার ছেলে জননীকে আপাত বলে নাকি? আমি হতচকিত হয়ে গেলাম। নিজেকে শাসন করে যায় যায় বললাম, এমন ভুল কেন হয় আমার।। আমার সেই মা চলে গেলেন। আমি পুনরায় হলাম। এখন এবার মা বলে ডাকি ন খন তাকে সন্ধান করি, তিনি আমার মনের মধ্যে বসে থেকে বলেন, আছিরে ছেলে! আমি আছি। তোদের ছেড়ে এলাম বলে সুখে নেই আমি। তবু তোরা সুখে থাক। এই আমার অন্তিম কামনা। তিনি জীবনভর কতখানি মহৎকাজ করে গেলেন। তার হিসেব হবে যথাসময়ে। কিন্তু তিনি যে মহৎ হবার বাসনাকে বিস্তার করেছেন তাঁর ছাত্র-ছাত্রীদের মধ্যে সেটা বারবার দেখতে পাই। বাংলাদেশকে তিনি চেয়েছেন, বাঙালিকে প্রকৃত সত্যের মধ্যে খুঁজেছেন— তার এই চাওয়া ও খোঁজার মধ্যে গরমিল আর গোঁজামিল দেখিনি কোনোদিন। মাতৃত্বের সহ অধিকার তিনি সহজেই নিয়েছিলেন নিজের ঘাড়ে। তাইতো যেখানেই যাই, যেখানেই বলি, সবাই বলে, আপাতো কেবল আপাই ছিলেন না, মা ছিলেন। সবাই কি আর এমন পরিচিতি পেয়েছেন। যেমন পেয়েছিলেন ড. নীলিমা ইব্রাহিম— জননী নীলিমা ইব্রাহিম।'),
                ),
              ],
            ),
            const SizedBox(
              height: 50,
            ),
            Container(
              height: 60,
              color: Colors.black,
              child: const Center(
                child: Text(
                  "Copyright 2024, All Rights Reserved",
                  style: TextStyle(
                      color: Colors.white, fontWeight: FontWeight.bold),
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
